{
  "personalInfo": {
    "name": "Mohamed IBEN EL ABED",
    "title": "Senior Backend-Entwickler & Technical Lead",
    "description": "Erfahrener Backend-Entwickler mit Hintergrund in Netzwerktechnik, hervorragend in JAVA und BPMN. Nachgewiesene Erfolgsbilanz im Banken- und Versicherungswesen, Bereitstellung optimierter Lösungen für Privat- und Firmenkunden mit über 5 Jahren Erfahrung.",
    "avatar": {
      "url": "https://lh3.googleusercontent.com/d/1JxR6_v1q40TSt5FzgJdKvEeONXoe2Mk1"
    },
    "resumeUrl": "https://drive.google.com/file/d/1GlttHmMtXq8A2D1LwwdqaCg-NElsiXKS/view?usp=drive_link"
  },
  "about": {
    "title": "Über Mich",
    "description": "Leidenschaftlich daran interessiert, innovative Lösungen zu schaffen, die die Lücke zwischen komplexen technischen Anforderungen und eleganten Benutzererfahrungen schließen. Ich spezialisiere mich auf die Architektur skalierbarer Systeme, die geschäftlichen Erfolg fördern.",
    "skillsTitle": "Technologien",
    "achievementsTitle": "Wichtige Erfolge"
  },
  "work": {
    "title": "Ausgewählte Projekte",
    "description": "Eine Auswahl von Projekten, die meine Expertise in Lösungsarchitektur, Full-Stack-Entwicklung und Cloud-Infrastruktur demonstrieren."
  },
  "projects": [
    {
      "id": 1,
      "title": "Bankerise Firmenkundenbanking-Plattform",
      "company": "Proxym Group",
      "role": "Senior Backend-Entwickler & Technical Lead",
      "description": "Wartung und Weiterentwicklung einer umfassenden Firmenkundenbanking-Lösung für Unternehmenskunden, entwickelt nach Domain-Driven Design und Hexagonal Architecture Prinzipien.",
      "markdownDescription": "# Senior Backend-Entwickler & Technical Lead - Bankerise Firmenkundenbanking-Plattform\n\n## Projektübersicht\n\nAls Technical Lead für Bankerise Firmenkundenbanking-Plattform leitete ich Evolution eines geschäftskritischen Systems, das Unternehmen ermöglicht, Mehrwährungskonten, nationale/internationale Zahlungen, Handelsfinanzierung und umfassende Berichte über eine einheitliche Schnittstelle zu verwalten. Zusammenarbeit mit 8 Banken in Tunesien und Frankreich zur Modernisierung Firmenkundenbanking-Erfahrungen. Das Projekt erreichte 15.000+ Unternehmenskunden mit 2.000+ täglichen Benutzern und verarbeitete 8.000+ Transaktionen/Monat, während gleichzeitig tiefes Verständnis komplexer Banking-Domänen entwickelt wurde. **Business Impact**: Reduzierung Implementierungszeit von 12 auf 3 Monate. Ermöglichung bankspezifischer Anpassungen innerhalb Wochen. Unterstützung 8 Banken mit einheitlicher Plattform bei gleichzeitiger Erfüllung individueller Anforderungen.\n\n<!-- DIAGRAM_PLACEHOLDER: Bankerise System-Architektur - Domain-Driven Design Schichten, Hexagonal Architecture Ports/Adapters, Event-Sourcing, Core Banking Integration, Workflow-Engine -->\n\n## Technische Architektur\n\nBau strategische Domain-Driven Design-Architektur mit Hexagonal Architecture (Ports & Adapters) zur Isolierung Geschäftslogik. Domain Layer implementiert Aggregate (Accounts, Transaktionen, Genehmigungen) mit Event Sourcing zur Prüfverfolgung. Infrastructure Layer handhabt Persistenz (PostgreSQL), Authentifizierung (Keycloak OAuth2/OIDC), Messaging (Kafka) und Core Banking Integration. Modulares Design mit 50+ Subdomains organisiert nach Bounded Contexts.\n\n## Hauptverantwortlichkeiten\n\n- **Architekturleitung**: Definition und Durchsetzung Domain-Driven Design und Hexagonal Architecture-Patterns über Plattform\n- **Technisches Leadership**: Führung 6-köpfiges Backend-Team durch Architekturentscheidungen, Code-Reviews und Best Practices\n- **Feature-Entwicklung**: Implementierung komplexer Banking-Operationen (Mehrebenen-Genehmigung, Zahlungsabwicklung, Kontoaggregation)\n- **Workflow-Engine**: Aufbau BPMN-basierter Workflow-Engine mit Flowable für Genehmigungsketten, Eskalationen und Audit-Trails\n- **Performance-Optimierung**: Optimierung Datenbankabfragen und Transaktionsverarbeitung für <2s Transaktionszeit\n- **Integrationsentwicklung**: Entwurf REST APIs für Frontend-Anwendungen und Core Banking-Systeme\n- **Event Sourcing**: Implementierung Event-Store für vollständige Audit-Historie und Zustandsrekonstruktion\n- **Mentoring**: Schulung Junior-Entwickler in DDD, Hexagonal Architecture und Banking-Domain-Konzepten\n\n## Wichtigste Erfolge & Impact\n\n- **8 Banken Unterstützung**: Skalierung Plattform zur Unterstützung 8 Finanzinstitute mit kundenspezifischen Anforderungen\n- **15K+ Unternehmenskunden**: Verarbeitung Bankoperationen für 15.000+ Unternehmenskunden mit 2.000+ täglichen Benutzern\n- **8K Transaktionen/Monat**: Skalierung System zur Verarbeitung 8.000+ Transaktionen monatlich mit <2s Antwortzeit\n- **75% Reduzierung Implementierungszeit**: Verkürzung Bank-Onboarding von 12 Monaten auf 3 Monate durch modulare Architektur\n- **ArchUnit Governance**: Implementierung 80% automatisierte Architekturregeln Durchsetzung via ArchUnit-Tests\n- **Zero Downtime Deployments**: Aktivierung wöchentliche Releases ohne Produktionsunterbrechungen\n\n## Technische Highlights\n\n### Domain-Driven Design Implementierung\nStrukturiertes System in Strategic Design Patterns: Bounded Contexts trennend Zahlungsabwicklung, Kontoführung und Genehmigungen; Shared Kernel für gemeinsame Domänen-Logik; Anti-Corruption Layer für Legacy-Systeme; Context Mapping dokumentierend Beziehungen zwischen Domains.\n\n<!-- CODE_PLACEHOLDER: Domain Model Beispiel - Aggregate Root (Transaktion), Value Objects, Domain Events, Repository Pattern -->\n\n### Hexagonal Architecture (Ports & Adapters)\nZentrale Business-Logik vollständig isoliert via Ports (Schnittstellen) und Adapters (Implementierungen). Inbound-Adapter (REST Controller, Messaging Listener) invokieren Business-Logik. Outbound-Adapter (Database Repository, Core Banking Clients) implementieren Infrastructure-Concerns. Aktivierung einfaches Testing via Mock Adapters.\n\n### BPMN Workflow-Engine mit Flowable\nImplementierung komplexer Genehmigungsprozesse via Flowable BPM Engine mit konfigurierbare BPMN-Workflows für Multi-Level-Genehmigung, Role-Based Assignment, parallele/sequentielle Gates, automatisierte Eskalation bei Verzögerungen und Audit-Trail-Aufzeichnung.\n\n## Herausforderungen & Lösungen\n\n**Herausforderung**: Jede Bank besitzt einzigartige Genehmigungsworkflows, Berichtanforderungen und Integrationsbedürfnisse.\n\n**Lösung**: Implementierung Multi-Tenant-Architektur mit Tenant-spezifischen Konfigurationen gespeichert in Datenbank. BPMN-Workflow-Templates pro Bank-Anforderungen. Implementierung Feature Flags für selektive Feature-Aktivierung.\n\n**Impact**: Neue Bank-Onboarding reduziert von 12 auf 3 Monate. Tenant-Isolation gewährleistet keine Cross-Contamination.\n\n---\n\n**Herausforderung**: Komplexe Transaktionen mit mehrstufigen Genehmigungsketten waren langsam (3-4s+ Antwortzeit).\n\n**Lösung**: Performance-Optimierung via Query-Optimierung (Indizes, JOIN-Reduzierung), Redis-Caching für Benutzerberechtigungen und Konfigurationen, Connection Pooling (HikariCP) und Async-Processing für Non-Blocking-Operationen.\n\n**Impact**: Transaktionsverarbeitungszeit reduziert von 3.5s auf 800ms. 80% Reduzierung Datenbankabfragen durch Caching.\n\n## Team & Zusammenarbeit\n\n12-köpfiges Produktteam (6 Backend, 3 Frontend, 2 QA, 1 Product Owner) in Agile-Scrum mit 3-Wochen-Sprints. Durchführung Architecture-Reviews, technische Designsitzungen und Knowledge-Sharing-Sessions. Enge Zusammenarbeit mit Business-Analysten zum Verständnis Banking-Domain-Komplexitäten. Mentoring von 4 Junior-Entwicklern in DDD und sauberer Architektur.\n\n<!-- SCREENSHOT_PLACEHOLDER: Bankerise Dashboard - Firmenkonto-Übersicht, ausstehende Genehmigungen, Transaktionsverlauf, Multi-Währungs-Support -->",
      "image": {
        "url": "https://lh3.googleusercontent.com/d/1AFqRxn2BtHNQ2yQm5Sz3uBtng-TfNq90"
      },
      "technologies": [
        {
          "name": "Java",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/java/java-original.svg"
          }
        },
        {
          "name": "Spring Boot",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/spring/spring-original.svg"
          }
        },
        {
          "name": "PostgreSQL",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/postgresql/postgresql-original.svg"
          }
        },
        {
          "name": "Docker",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/docker/docker-original.svg"
          }
        },
        {
          "name": "Keycloak",
          "icon": {
            "url": "https://www.keycloak.org/resources/images/logo.svg"
          }
        },
        {
          "name": "Liquibase",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon@latest/icons/liquibase/liquibase-original.svg"
          }
        },
        {
          "name": "Domain-Driven Design",
          "icon": {
            "url": "https://example.com/ddd-icon.svg"
          }
        },
        {
          "name": "Hexagonale Architektur",
          "icon": {
            "url": "https://www.svgrepo.com/show/44395/hexagon.svg"
          }
        }
      ],
      "links": {
        "live": "#",
        "github": "#"
      }
    },
    {
      "id": 2,
      "title": "BNA Retail Digital Banking",
      "company": "Proxym Group",
      "role": "Produktintegrationsspezialist",
      "description": "Mitwirkung an der Entwicklung einer Digital Retail Anwendung für BNA unter Nutzung der Bankerise Banking-Plattform von Proxym. Führung der digitalen Transformation im Bankensektor mit innovativen Lösungen.",
      "markdownDescription": "# Produktintegrationsspezialist - BNA Retail Digital Banking\n\n## Projektübersicht\n\nAls Produktintegrationsspezialist für BNA Retail Digital Banking leitete ich Integration digitalen Banking-Beschleunigers in Bankerise-Plattform zur Aktivierung moderner Retail-Banking-Erfahrungen für Banque Nationale Agricole Tunesiens. Das Projekt verband Bankerise-Flexibilität mit BNAs proprietärem Core Banking über Dual-Protocol-Adapter-Schicht und nutzte BPMN-Workflows für Kontoeröffnung, Kreditanträge und Transaktions-Routing. Zusammenarbeit mit BNA-Stakeholdern, Bankerise-Produktteam und Infrastructure-Team zur Sicherstellung nahtloser Integration. **Business Impact**: Zeitfenster Implementierung von 8-12 auf 4 Monate verkürzt. Aktivierung digitales Onboarding mit 70% Reduzierung manueller Schritte. Bereitstellung skalierbarer Architektur unterstützend zukünftige Feature-Erweiterungen.\n\n<!-- DIAGRAM_PLACEHOLDER: BNA Integration-Architektur - Bankerise Core, digitaler Beschleuniger, Dual-Protocol-Adapter (SOAP/REST), BNA Core Banking, Flowable BPMN-Engine -->\n\n## Technische Architektur\n\nIntegration digitalen Banking-Beschleunigers in Bankerise-Plattform, Verbindung zu proprietärem BNA Core Banking via Adapter-Schicht unterstützend Dual-Protokolle (SOAP/REST). Flowable BPM Engine orchestriert Business-Workflows (Kontoeröffnung, Kreditantrag). Authentifizierung via Keycloak mit rollenbasierter Zugriffskontrolle für Retail-Kunden, Agents und Administratoren. PostgreSQL für transactionale Daten mit Redis-Caching für Session-Management.\n\n## Hauptverantwortlichkeiten\n\n- **Produktintegration**: Integration Digital-Banking-Beschleuniger (Frontend + Backend-Services) in Bankerise-Plattform\n- **Adapter-Entwicklung**: Aufbau Dual-Protocol-Adapter-Schicht (SOAP + REST) zur Kommunikation mit BNA Core Banking\n- **BPMN Workflow-Entwicklung**: Implementierung Flowable-basierte Workflows für Kontoeröffnung, Kreditanträge und Transaktionsabwicklung\n- **API-Entwicklung**: Entwurf REST APIs für Mobile/Web-Frontend-Kommunikation mit Backend-Services\n- **Authentifizierung Integration**: Konfiguration Keycloak OAuth2/OIDC für sicheres Retail-Banking-Login und Autorisierung\n- **Technische Spezifikation**: Übersetzung Business-Anforderungen in technische Designs und Implementation Plans\n- **Cross-Team Koordination**: Koordination zwischen Bankerise-Produktteam, BNA IT und Infrastructure-Teams\n- **Knowledge Transfer**: Durchführung Technical-Workshops und Dokumentationserstellung für BNA-Entwickler\n\n## Wichtigste Erfolge & Impact\n\n- **50% Implementierungszeitreduzierung**: Projektabschluss 4 Monate vs. initial geschätzte 8-12 Monate\n- **70% Reduzierung Onboarding-Zeit**: Transformation manuelle 5-7 Tage Kontoeröffnung zu digitalen 24-Stunden-Prozess\n- **Dual-Protocol-Integration**: Aufbau flexible Adapter-Schicht behandelnd sowohl Legacy-SOAP als auch moderne REST-Endpunkte\n- **Zero Outages**: Erfolgreiche Produktionseinführung ohne System-Downtime oder kritische Issues\n- **Skalierbare Architektur**: Design wiederverwendbare Integrationsmuster replizierbar für andere Banken\n- **Team Enablement**: Schulung 6 BNA-Entwickler zur Wartung und Erweiterung integrierter Lösung\n\n## Technische Highlights\n\n### Dual-Protocol Core Banking Adapter\nEntwicklung robuster Adapter-Schicht handhabend SOAP-Webservices (Legacy) und REST-APIs via Spring Integration mit Message Routing basierend Operation-Type, Protocol Transformation (SOAP ↔ REST), Circuit Breaker (Resilience4j) für Fehlertoleranz und Retry-Mechanismen mit exponential Backoff.\n\n<!-- CODE_PLACEHOLDER: Adapter-Implementierung - Protocol Router, SOAP/REST Transformer, Circuit Breaker-Konfiguration, Retry-Logik -->\n\n### BPMN Kontoeröffnungs-Workflow\nMulti-Stage-Workflow mit Flowable: Kundeninformation-Erfassung (persönliche Details, Dokument-Upload) → Validierung (KYC-Prüfungen, Dokumenten-Verifikation) → Genehmigung (automatisch für Standard / manuell für Komplexfälle) → Core Banking Kontoerstellung → Benachrichtigung (Email/SMS-Bestätigung).\n\n### OAuth2/OIDC Authentifizierungs-Flow\nKeycloak-basierte Authentifizierung mit Retail-Customer Realm, Agent Realm und Admin Realm. Implementierung Authorization-Code-Flow für Web, PKCE-Flow für Mobile, Rolle-Mapping zu Backend-Services und Token-Refresh-Mechanismen.\n\n## Herausforderungen & Lösungen\n\n**Herausforderung**: BNA Core Banking verwendete Legacy-SOAP-Webservices mit inkonsistenter Dokumentation und unvorhersehbaren Antworten.\n\n**Lösung**: Aufbau robuster Adapter-Schicht mit Fehlerbehandlung, Logging und Retry-Logik. Enge Zusammenarbeit mit BNA IT zur Klärung API-Verhalten. Implementierung Fallback-Mechanismen für kritische Operationen. Umfassende Integration-Tests mocken SOAP-Antworten.\n\n**Impact**: Stabile Integration mit <1% Fehlerquote. Reduzierung Integration-Debugging-Zeit 60%.\n\n---\n\n**Herausforderung**: Business forderte flexible Kontoeröffnungs-Workflows variierend nach Kontotyp, Kundentyp und regulatorischen Anforderungen.\n\n**Lösung**: Nutzung Flowable BPM-Engine zur Externalisierung Workflow-Logik aus Code. Erstellung konfigurierbarer BPMN-Workflows modifizierbar via Flowable-Designer. Implementierung Business-Rules-Engine (Drools) für komplexe Genehmigungsentscheidungen.\n\n**Impact**: Workflow-Änderungen erfordern keine Code-Deployments. Business-Analysten können Workflows via Tools modifizieren. Deployment neue Kontotypen in Tagen statt Wochen.\n\n## Team & Zusammenarbeit\n\n9-köpfiges Cross-Functional-Team (4 Backend, 2 Frontend, 1 QA, 1 Business Analyst, 1 DevOps) in Agile mit 2-Wochen-Sprints. Tägliche Koordination mit BNA IT-Team zur Klärung Integration-Anforderungen. Wöchentliche Demos mit BNA-Stakeholdern zur Sicherstellung Alignment mit Business-Zielen. Hosting technischer Workshops zur Übergabe Knowledge an BNA-Team.\n\n<!-- SCREENSHOT_PLACEHOLDER: BNA Digital Banking Interface - Dashboard, Kontoeröffnungs-Workflow, Transaktionshistorie, Kreditantrag-Status -->",
      "image": {
        "url": "https://lh3.googleusercontent.com/d/1dxSiXL55Z3ZHNt0lydoLyiEKwy1GvRob"
      },
      "technologies": [
        {
          "name": "Java",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/java/java-original.svg"
          }
        },
        {
          "name": "Spring Boot",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/spring/spring-original.svg"
          }
        },
        {
          "name": "REST APIs",
          "icon": {
            "url": "https://www.svgrepo.com/svg/447473/rest-api"
          }
        },
        {
          "name": "CI/CD",
          "icon": {
            "url": "https://www.svgrepo.com/svg/445634/cicd"
          }
        },
        {
          "name": "Docker",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/docker/docker-original.svg"
          }
        },
        {
          "name": "PostgreSQL",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/postgresql/postgresql-original.svg"
          }
        }
      ],
      "links": {
        "live": "#",
        "github": "#"
      }
    },
    {
      "id": 3,
      "title": "BICICI Banking-Webanwendung",
      "company": "Proxym Group",
      "role": "Technical Lead",
      "description": "Leitung der Entwicklung einer Webanwendung für die Internationale Bank für Handel und Industrie der Elfenbeinküste zur Verbesserung der Dienstleistungen für Bankagenten.",
      "markdownDescription": "# Technical Lead - BICICI Banking-Webanwendung\n\n## Projektübersicht\n\nAls Technical Lead für BICICI (Banque Internationale pour le Commerce et l'Industrie de la Côte d'Ivoire) Banking-Webanwendung leitete ich Entwicklung modernisierten Bank-Agent-Portals transformierend Geschäftsprozesse via intelligente Automatisierung. System diente 200+ Bank-Agenten über Côte d'Ivoire zur Durchführung Kontoöffnung, Kreditanträge und Transaktionsabwicklung mit dramatischer Effizienzsteigerung. Projekt revolutionierte BICICI-Operationen durch Ersetzung papierbasierten Prozesse mit digitalisierten BPMN-orchestrierten Workflows. **Business Impact**: Reduzierung Agent-Onboarding von 2 Wochen auf 2 Tage. Verkürzung Kontoöffnung von 3-5 Tagen auf 4 Stunden. Aktivierung Echtzeit-Reporting und Compliance-Tracking für Regulierungs-Audits.\n\n<!-- DIAGRAM_PLACEHOLDER: BICICI System-Architektur - Agents Web Portal, Flowable BPMN Engine, Form.io Dynamic Forms, Core Banking Integration, PostgreSQL, Audit Trail System -->\n\n## Technische Architektur\n\nAufbau Agent-Portal mit Spring Boot Backend integrierend Flowable BPM Engine für Workflow-Orchestrierung. Form.io-Framework aktiviert dynamische Formulargenerierung konfigurierbar via JSON-Schemas eliminierend Hard-Coded-Formulare. PostgreSQL speichert Transaktionsdaten, Workflow-Historie und Audit-Logs. Integration mit BICICI Core Banking via REST APIs für Kontomanagement, Transaktionsabwicklung und Kundenverifikation.\n\n## Hauptverantwortlichkeiten\n\n- **Technisches Leadership**: Leitung 5-köpfiges Team (3 Backend, 1 Frontend, 1 QA) durch Architekturdesign und Implementierung\n- **BPMN Workflow-Design**: Entwurf komplexer Banking-Workflows (Kontoöffnung, Kreditanträge, Transaktionsgenehmigung) mit Flowable\n- **Dynamische Formulargenerierung**: Implementierung Form.io-basiertes System ermöglichend Business-Benutzer-Formularmodifikation ohne Code\n- **Agent Portal-Entwicklung**: Aufbau Web-Portal mit Dashboard, Transaktions-Management, Customer-Lookup und Reporting\n- **Core Banking Integration**: Entwicklung Integration-Schicht verbindend Portal zu Legacy Core Banking-System\n- **Audit & Compliance**: Implementierung umfassender Audit-Trail-Tracking aller Agent-Aktionen für Regulierungs-Compliance\n- **Performance-Tuning**: Optimierung Systemperformance unterstützend 200+ gleichzeitige Agents mit <1s Response-Time\n- **Deployment & Training**: Überblick Produktions-Deployment und Training 200+ Bank-Agents zur Systemnutzung\n\n## Wichtigste Erfolge & Impact\n\n- **200+ Agents Enablement**: Erfolgreiche Bereitstellung zu 200+ Bank-Agents über Côte d'Ivoire-Filialen\n- **90% Papierreduzierung**: Transformation papierbasierten Prozesse zu digitalen Workflows eliminierend manueller Dateneinträge\n- **85% Zeitreduzierung**: Verkürzung Kontoöffnung von 3-5 Tagen zu 4 Stunden via Automatisierung\n- **Null Produktions-Issues**: Fehlerfreie Produktionseinführung ohne kritische Bugs oder System-Ausfälle\n- **Compliance Achievement**: Aktivierung Echtzeit-Audit-Trail-Reporting erfüllend Côte d'Ivoire Regulierungs-Anforderungen\n- **Agent-Produktivität**: 3x Erhöhung Agent-Transaktions-Throughput via Workflow-Automatisierung\n\n## Technische Highlights\n\n### Flowable BPMN Workflow-Engine\nOrchestration aller Banking-Operationen via BPMN-Workflows mit Multi-Stage-Kontoöffnung (Datenerfassung → KYC-Verifikation → Manager-Genehmigung → Core Banking-Erstellung), Kreditantrags-Routing zu Kreditoffizieren basierend Betragsschwellen, Transaktionsgenehmigung-Workflows mit Vier-Augen-Prinzip und Service-Task-Integration mit externen APIs.\n\n<!-- CODE_PLACEHOLDER: BPMN Workflow-Definition - Kontoöffnungsprozess mit Multi-Stage-Genehmigung, Parallele-Gateways, Service-Tasks -->\n\n### Form.io Dynamisches Formularsystem\nJSON-basierte Formular-Definition aktivierend Business-Benutzer zur Modifizierung Formular-Felder, Validierung und Layout ohne Developer-Involvement. Formular-Rendering-Engine übersetzt JSON zu HTML, Conditional-Logic für Feld-Anzeige basierend Benutzereingaben und Formular-Versioning zur Verfolgung Änderungshistorie.\n\n### Audit Trail & Compliance-System\nUmfassender Audit-Log erfassend Agent-Aktionen (Login, Transaktionen, Datenzugriffe), Timestamps und User-Identitäten, Workflow-Statusänderungen und Genehmigungsketten sowie Systemfehler und Exceptions. Reporting-Interface ermöglichend Compliance-Officers zur Generierung Audit-Reports für regulatorische Reviews.\n\n## Herausforderungen & Lösungen\n\n**Herausforderung**: BICICI Core Banking war Legacy-System mit limitierten Integration-Capabilities und instabiler API-Performance.\n\n**Lösung**: Aufbau robuste Integration-Schicht mit Circuit Breaker (Resilience4j) zur Fehlertoleranz, Retry-Logik mit Exponential-Backoff, Request-Queueing zur Glättung Traffic-Spitzen und Fallback-Mechanismen erlaubend Agents lokales Weitermachen mit späterer Synchronisation.\n\n**Impact**: 99.5% Integration-Erfolgsrate trotz Legacy-System-Instabilität. Agents erfahren keine Downtime via Queueing.\n\n---\n\n**Herausforderung**: Bank forderte Formular-Flexibilität zur Anpassung neuer Kontotypen und regulatorischer Anforderungen ohne Developer-Involvement.\n\n**Lösung**: Implementierung Form.io-Dynamic-Forms ermöglichend Business-Benutzer zur Formular-Kreation/Modifizierung via Drag-and-Drop-Designer. JSON-Schema-Speicherung in Datenbank erlaubend Runtime-Änderungen. Formular-Versioning gewährleistet Kompatibilität mit In-Flight-Workflows.\n\n**Impact**: Neue Formulare deploybar in Stunden vs. Wochen. Business-Team autonom verwaltend Formular-Änderungen. Entwickler-Abhängigkeit eliminiert.\n\n## Team & Zusammenarbeit\n\n5-köpfiges Team (3 Backend, 1 Frontend, 1 QA) in Agile-Scrum mit 2-Wochen-Sprints. Enge Koordination mit BICICI Business-Analysten zur Definition Workflow-Anforderungen. Weekly-Demos mit Bank-Stakeholdern zur Validierung Feature-Entwicklung. On-Site-Deployment-Unterstützung in Abidjan, Côte d'Ivoire zur Sicherstellung reibungsloser Produktionseinführung und Agent-Training.\n\n<!-- SCREENSHOT_PLACEHOLDER: BICICI Agent Portal - Dashboard mit Transaktionsübersicht, Kontoöffnungs-Workflow, Kundensuchschnittstelle, Reporting-Panel -->",
      "image": {
        "url": "https://lh3.googleusercontent.com/d/1VfZAgsp25SyrMgv2FghKFdnJO8m7JEBs"
      },
      "technologies": [
        {
          "name": "Java",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/java/java-original.svg"
          }
        },
        {
          "name": "Spring Boot",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/spring/spring-original.svg"
          }
        },
        {
          "name": "Flowable BPMN",
          "icon": {
            "url": "https://www.svgrepo.com/show/395899/process.svg"
          }
        },
        {
          "name": "Formio",
          "icon": {
            "url": "https://example.com/formio-icon.svg"
          }
        },
        {
          "name": "PostgreSQL",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/postgresql/postgresql-original.svg"
          }
        },
        {
          "name": "Docker",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/docker/docker-original.svg"
          }
        }
      ],
      "links": {
        "live": "#",
        "github": "#"
      }
    },
    {
      "id": 4,
      "title": "Insurise® Digitale Versicherungsplattform",
      "company": "Proxym Group",
      "role": "Backend-Entwickler",
      "description": "Entwicklung einer innovativen Omnichannel-Digitalversicherungslösung zur Verbesserung der Kundenerfahrung mit über 20.000 Nutzern.",
      "markdownDescription": "# Backend-Entwickler - Insurise® Digitale Versicherungsplattform\n\n## Projektübersicht\n\nAls Backend-Entwickler für Insurise®-Plattform baute ich innovative Omnichannel-Digital-Versicherungslösung transformierend Kundeninteraktionen für 3 Major-Versicherungskunden (BH Assurance, Comar, Star Assurance) in Tunesien. Plattform revolutionierte Industrie aktivierend digitale Angebote, Policy-Käufe, Claims-Management und Portfolio-Tracking über nahtlose Kanäle. Bedienung 20.000+ Benutzer mit 1000-2000 täglichen Aktiv-Benutzern handhabend Auto-, Heim-, Professional-Liability- und Travel-Versicherung mit Echtzeit-Quote-Generierung und digitaler Claims-Verarbeitung. **Business Impact**: Reduzierung Policy-Issuance von 5-7 Tagen zu sofortiger digitaler Ausstellung. Transformation Claims-Verarbeitung von 15-30 Tagen zu 3-5 Tagen.\n\n<!-- DIAGRAM_PLACEHOLDER: Insurise Platform-Architektur - Microservices, API Gateway, MongoDB-Dokumente, PostgreSQL-Transaktionen, Redis-Caching, Omnichannel-Zugriff -->\n\n## Technische Architektur\n\nAufbau modulares Backend mit Domain-orientierten Services für Quoting, Underwriting, Claims, Payments und Customer-Management. Duale Datenbank-Strategie: PostgreSQL für transactionale Versicherungsdaten, MongoDB für Dokumentenspeicherung. Redis cached High-Frequency-Daten (Tarife, Konfigurationen). Elasticsearch antreibt Search für Kunden, Policies und Claims. Integration mit Payment-Gateways, SMS/Email-Providern und Third-Party-Pricing-Engines via RESTful APIs.\n\n## Hauptverantwortlichkeiten\n\n- **Plattform-Entwicklung**: Aufbau Core-Infrastruktur inkl. Quoting-Engine, Underwriting-Management, Claims-Verarbeitung und Payment-Workflows\n- **Omnichannel API-Schicht**: Design APIs unterstützend Web, Mobile und Agent-Portale mit konsistenter Erfahrung\n- **Quoting-Engine**: Implementierung Real-Time-Pricing-Engine kalkulierend Prämien basierend Risikofaktoren, Coverage-Optionen und kundenspezifischen Pricing-Regeln\n- **Claims-Workflow**: Entwicklung End-to-End-Prozess (Submission, Document-Upload, Adjuster-Assignment, Approval-Chains, Settlement)\n- **Payment-Integration**: Verbindung Multiple Payment-Gateways (Paymee, ClickToPay) für Subscriptions, Renewals und Installments\n- **Datenbank-Design**: Architektur Hybrid-Schema optimierend ACID-Transaktionen (PostgreSQL) und flexible Dokumente (MongoDB)\n- **POCs Client**: Vorbereitung und Präsentation Proof of Concepts demonstrierend Platform-Capabilities potentiellen Kunden\n\n## Wichtigste Erfolge & Impact\n\n- **20K+ Benutzer**: Skalierung zu 20.000+ Benutzern mit 1000-2000 Daily-Actives maintainend <2s Response-Time\n- **3 Major-Kunden**: Lieferung maßgeschneiderter Lösungen zu BH Assurance, Comar und Star Assurance\n- **Multi-Insurance-Engine**: Implementierung flexibler Produkt-Engine unterstützend 4 Insurance-Typen mit einzigartigen Pricing-Regeln\n- **95% Zeitreduzierung**: Verkürzung Policy-Issuance von Tagen zu Minuten via Automatisierung\n- **Omnichannel-Konsistenz**: Aktivierung nahtloser Erfahrung über Web-, Mobile- und Agent-Kanäle\n\n## Technische Highlights\n\n### Quoting-Engine mit Rules-System\nAufbau sophistizierte Pricing-Engine mit Risk-Assessment basierend Kunden-Profil und Coverage-Auswahl, konfigurierbaren Pricing-Regeln pro Produkt und Kunde, Real-Time-Premium-Kalkulation mit Tax/Fees-Anwendung und Multi-Währungs-Support.\n\n<!-- CODE_PLACEHOLDER: Quoting-Engine-Service - Risk-Kalkulation, Pricing-Rules-Evaluation, Premium-Berechnung mit Builder-Pattern -->\n\n### Claims-Verarbeitungs-Workflow\nDigitales 6-Stage-System: Submission (Incident-Details, Dokumentation) → Validation (Policy-Coverage, Eligibility) → Assignment (intelligente Adjuster-Allocation) → Assessment (Photo-Upload, Adjuster-Review) → Approval (Multi-Level-Workflow) → Settlement (Payment, Policy-Adjustment).\n\n### Optimierter Daten-Storage\nPostgreSQL für strukturierte Transaktionen (Policies, Kunden, Payments), MongoDB für flexible Dokumente (PDFs, Claims-Fotos, Verträge), Redis für High-Frequency-Cache (Tarife, Configs, Sessions), Elasticsearch für schnelle Search-Indizierung.\n\n## Herausforderungen & Lösungen\n\n**Herausforderung**: Jeder Insurance-Typ (Auto, Home, Travel, Professional) besitzt einzigartige Pricing-Faktoren, Coverage-Optionen und regulatorische Requirements.\n\n**Lösung**: Design flexibler Produkt-Engine mit konfigurierbaren Pricing-Regeln, Coverage-Templates und Validation-Schemas. Nutzung Strategy-Pattern für typ-spezifische Logik. Externalisierung Business-Regeln in Configuration.\n\n**Impact**: Onboarding 4 Insurance-Typen in 18 Monaten ohne Architecture-Änderungen. Aktivierung Produkt-Launches in Wochen vs. Monaten.\n\n---\n\n**Herausforderung**: Premium-Kalkulation involvierte komplexe Risk-Assessment, Pricing-Regeln, Discounts und Taxes—potentiell langsam.\n\n**Lösung**: Implementierung Multi-Layer-Caching-Strategie mit Redis für Tarife und Konfigurationen. Optimierung Pricing-Engine mit Lazy-Evaluation. Pre-Computation allgemeiner Risk-Profile. Async-Kalkulation für komplexe Szenarien.\n\n**Impact**: Response-Time <800ms für 95% Quotes. 70% Reduzierung Datenbank-Queries.\n\n## Team & Zusammenarbeit\n\n10-köpfiges Produktteam (7 Backend, 2 Frontend, 1 QA) in Agile mit 2-Wochen-Sprints, Daily-Standups, Retrospektiven und Sprint-Demos. Collaboration mit Insurance-Business-Analysten, UX-Designern und QA-Engineers. Hosting technischer Sessions zu Microservices und Platform-Architektur.\n\n<!-- SCREENSHOT_PLACEHOLDER: Insurise Customer Portal - Policy-Dashboard, Real-Time-Quote-Generierung, Claims-Submission, Payment-Historie -->",
      "image": {
        "url": "https://lh3.googleusercontent.com/d/1k3u470MWuVmRHhGeLoZhjl1h-HcEu_9a"
      },
      "technologies": [
        {
          "name": "Java",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/java/java-original.svg"
          }
        },
        {
          "name": "Spring Boot",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/spring/spring-original.svg"
          }
        },
        {
          "name": "PostgreSQL",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/postgresql/postgresql-original.svg"
          }
        },
        {
          "name": "MongoDB",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/mongodb/mongodb-original.svg"
          }
        },
        {
          "name": "REST APIs",
          "icon": {
            "url": "https://www.svgrepo.com/svg/447473/rest-api"
          }
        },
        {
          "name": "Docker",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/docker/docker-original.svg"
          }
        }
      ],
      "links": {
        "live": "#",
        "github": "#"
      }
    },
    {
      "id": 5,
      "title": "CHIFCO DevOps-Transformation",
      "company": "CHIFCO",
      "role": "DevOps-Ingenieur",
      "description": "Leitung kultureller DevOps-Transformation reduzierend Bereitstellungszeit um 3 Tage und Ausfallzeit von 1-2 Tagen auf 5-10 Minuten. Implementierung automatisierte CI/CD-Pipelines mit Jenkins und GitLab CI, Containerisierung Anwendungen mit Docker und Automatisierung Infrastruktur mit Ansible.",
      "markdownDescription": "# DevOps-Ingenieur - CHIFCO DevOps-Transformation\n\n## Projektübersicht\n\nAls DevOps-Ingenieur bei CHIFCO leitete ich transformative Initiative integrierend DevOps-Methodologien in Entwicklungskultur. Die Herausforderung: Manuelle Deployments erforderten 3-5 Tage mit extensiver Koordination, häufigen Rollbacks und 1-2 Tage Ausfallzeit pro Release. Arbeitend mit Software-Architekt und Systemadministrator leitete ich technische Implementierung revolutionierend Software-Delivery via umfassende CI/CD-Automatisierung, Containerisierung und Infrastructure-as-Code. **Business Impact**: Reduzierung Deployment von 3-5 Tagen zu Stunden. Verringerung Ausfallzeit von 1-2 Tagen zu 5-10 Minuten. Aktivierung wöchentlicher Releases statt quartalsweise. Transformation Kultur von \"Deployment-Angst\" zu \"Deploy confident and frequently\".\n\n<!-- DIAGRAM_PLACEHOLDER: CHIFCO DevOps Pipeline-Architektur - GitLab/GitHub-Repositories, Jenkins CI/CD, Docker-Registry, Ansible-Automatisierung, Monitoring-Stack, Deployment-Umgebungen -->\n\n## Technische Architektur\n\nAufbau umfassende CI/CD-Orchestrierung mit Jenkins (automatisierter Build, Test, Deployment) und GitLab CI-Alternative. Containerisierung Full-Stack-Anwendungen via Docker gewährleistend Cross-Environment-Konsistenz. Automatisierung Infrastructure-Provisioning und Deployment mit Ansible-Playbooks. Version-Control via GitLab mit Branching-Strategien und Merge-Request-Workflows.\n\n## Hauptverantwortlichkeiten\n\n- **CI/CD Pipeline-Architektur**: Design umfassende Pipelines mit automatisiertem Build, Test, Quality-Gates und Deployment-Stages\n- **Anwendungs-Containerisierung**: Dockerisierung Full-Stack-Anwendungen erstellend Dockerfiles und docker-compose-Konfigurationen\n- **Jenkins-Administration**: Setup und Wartung Server, Job-Konfiguration, Plugin-Management, Security-Implementierung\n- **Infrastructure-Automatisierung**: Entwicklung Ansible-Playbooks für Provisioning, Deployment und Configuration-Management\n- **GitLab CI/CD**: Pipeline-Konfiguration, Runner-Setup-Implementierung, Environment-Deployment-Management\n- **Rollback-Mechanismen**: Implementierung automatisierter Rollback für fehlgeschlagene Deployments\n- **Shell-Scripting**: Erstellung Scripts für Deployment-Orchestrierung, Health-Checks und Wartung\n- **Kulturelles Leadership**: Durchführung Trainings, Dokumentationserstellung, Team-Mentoring zu DevOps-Praktiken\n\n## Wichtigste Erfolge & Impact\n\n- **95% Zeitreduzierung**: Verkürzung Deployment von 3-5 Tagen zu Stunden via vollständige Automatisierung\n- **95% Ausfallzeit-Reduzierung**: Verringerung Downtime von 1-2 Tagen zu 5-10 Minuten via Rolling-Deployments und Health-Checks\n- **Release-Frequenz**: Aktivierung wöchentlicher Releases statt quartalsweise, Beschleunigung Time-to-Market\n- **Null Manuelle Schritte**: Eliminierung aller manuellen Deployment-Schritte, Reduzierung menschlicher Fehler\n- **Entwickler-Produktivität**: Befreiung Entwickler von Deployment-Sorgen für Feature-Fokus\n- **Kulturelle Transformation**: Transformation Team-Mindset in 3 Monaten mit erhöhten Automatisierungs-Anfragen\n\n## Technische Highlights\n\n### Jenkins Pipeline-as-Code\nImplementierung Groovy-basierter Jenkinsfiles mit Multi-Stage-Pipeline: Build (Kompilierung, Unit-Tests) → Code-Qualität (SonarQube, Coverage) → Package (Docker-Images) → Staging-Deploy (Smoke-Tests) → Manuelle-Genehmigung → Production-Deploy (Rolling, Health-Checks) → Post-Deployment (Verifikation, Benachrichtigungen).\n\n<!-- CODE_PLACEHOLDER: Jenkins Pipeline-Script - Jenkinsfile mit Multi-Stage-Pipeline, Docker-Build, automatisierten Tests, Multi-Environment-Deployment -->\n\n### Ansible Infrastructure-as-Code\nAufbau systematischer Ansatz mit Rollen für Web-/Application-/Database-Server, Variables für Environment-spezifische Config, Handlers für Service-Restarts und idempotenten Operationen gewährleistend Wiederholbarkeit.\n\n### Docker-Optimierung\nImplementierung Multi-Stage-Builds trennend Build-/Runtime-Stages, minimale Production-Images reduzierend Attack-Surface, Build-Caching für Geschwindigkeit und integrierte Health-Checks.\n\n## Herausforderungen & Lösungen\n\n**Herausforderung**: Entwickler- und Operations-Teams skeptisch gegenüber DevOps, fürchtend Komplexität und Ausfälle.\n\n**Lösung**: Schrittweise Transformation: Start mit einfacher CI-Pipeline für Quick-Wins, Demonstration erfolgreicher automatisierter Deployments, Durchführung Hands-on-Workshops mit kontinuierlichem Support und Publicierung Verbesserungen.\n\n**Impact**: Vollständige Team-Akzeptanz in 3 Monaten. Erhöhte Automatisierungs-Anfragen.\n\n---\n\n**Herausforderung**: Legacy-Anwendungen mit komplexen Dependencies, undokumentierter Konfiguration, Environment-spezifischen Behaviors.\n\n**Lösung**: Systematische Dokumentation und Containerisierung: Dokumentierung aller Dependencies und Konfigurationen, Erstellung Dockerfiles erfassend Runtime-Environment, Nutzung Environment-Variablen für Config, Implementierung automatisierter Tests für Environment-Issues.\n\n**Impact**: Eliminierung \"Works on my machine\"-Probleme. Container gewährleistend identisches Cross-Environment-Verhalten.\n\n---\n\n**Herausforderung**: Business erforderte kontinuierliche Verfügbarkeit aber traditionelle Deployments benötigten Downtime.\n\n**Lösung**: Implementierung Blue-Green-Deployment mit Load-Balancer: Deployment zu \"green\"-Environment, Ausführung Smoke-Tests, Traffic-Switch, Beibehaltung \"blue\" für sofortigen Rollback, automatisierte Health-Checks vor Switching.\n\n**Impact**: Ausfallzeit reduziert von Stunden/Tagen zu 5-10 Minuten (nur DNS-Propagation).\n\n## Team & Zusammenarbeit\n\n3-köpfiges DevOps-Team (DevOps-Ingenieur, Software-Architekt, Systemadministrator) arbeitend mit 15+ Entwicklern über mehrere Projekte. Agile-Ansatz mit 2-Wochen-Sprints für DevOps-Feature-Delivery. Durchführung wöchentlicher Trainings zu Git-Workflows, Docker, CI/CD-Konzepten und Ansible. Erstellung umfassendes DevOps-Handbuch mit Runbooks, Troubleshooting-Guides und Best-Practices.\n\n<!-- SCREENSHOT_PLACEHOLDER: Jenkins-Dashboard - automatisierte Pipelines, Deployment-Historie, Build-Erfolgsraten, GitLab-Integration -->",
      "image": {
        "url": "https://lh3.googleusercontent.com/d/1ZZwBXlqiyYjaskr5OCGFeTx5u0_gnpT6"
      },
      "technologies": [
        {
          "name": "Jenkins",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/jenkins/jenkins-original.svg"
          }
        },
        {
          "name": "Docker",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/docker/docker-original.svg"
          }
        },
        {
          "name": "Ansible",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon@latest/icons/ansible/ansible-original.svg"
          }
        },
        {
          "name": "GitLab CI/CD",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/gitlab/gitlab-original.svg"
          }
        },
        {
          "name": "Linux",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon@latest/icons/linux/linux-original.svg"
          }
        },
        {
          "name": "Bash",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon@latest/icons/bash/bash-original.svg"
          }
        },
        {
          "name": "Groovy",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon@latest/icons/groovy/groovy-original.svg"
          }
        },
        {
          "name": "Git",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/git/git-original.svg"
          }
        }
      ],
      "links": {
        "live": "#",
        "github": "#"
      }
    }
  ],
  "skillCategories": [
    {
      "name": "Backend-Entwicklung",
      "icon": "Server",
      "skills": [
        {
          "name": "Java",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/java/java-original.svg"
          }
        },
        {
          "name": "Spring Boot",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/spring/spring-original.svg"
          }
        },
        {
          "name": "REST APIs",
          "icon": {
            "base64": "data:image/svg+xml;base64,PHN2ZyB3aWR0aD0iMjQiIGhlaWdodD0iMjQiIHZpZXdCb3g9IjAgMCAyNCAyNCIgZmlsbD0ibm9uZSIgeG1sbnM9Imh0dHA6Ly93d3cudzMub3JnLzIwMDAvc3ZnIj4KPHJlY3Qgd2lkdGg9IjI0IiBoZWlnaHQ9IjI0IiBmaWxsPSIjNjFEQUZCIi8+Cjx0ZXh0IHg9IjIiIHk9IjE2IiBmaWxsPSIjRkZGIiBmb250LXNpemU9IjkiIGZvbnQtZmFtaWx5PSJzZXJpZiIgZm9udC13ZWlnaHQ9ImJvbGQiPkFQSTwvdGV4dD4KPC9zdmc+"
          }
        }
      ]
    },
    {
      "name": "Prozessautomatisierung",
      "icon": "Workflow",
      "skills": [
        {
          "name": "BPMN",
          "icon": {
            "base64": "data:image/svg+xml;base64,PHN2ZyB3aWR0aD0iMjQiIGhlaWdodD0iMjQiIHZpZXdCb3g9IjAgMCAyNCAyNCIgZmlsbD0ibm9uZSIgeG1sbnM9Imh0dHA6Ly93d3cudzMub3JnLzIwMDAvc3ZnIj4KPHJlY3Qgd2lkdGg9IjI0IiBoZWlnaHQ9IjI0IiBmaWxsPSIjMzM4NEY2Ii8+Cjx0ZXh0IHg9IjIiIHk9IjE2IiBmaWxsPSIjRkZGIiBmb250LXNpemU9IjkiIGZvbnQtZmFtaWx5PSJzZXJpZiIgZm9udC13ZWlnaHQ9ImJvbGQiPkJQTU48L3RleHQ+Cjwvc3ZnPg=="
          }
        },
        {
          "name": "Flowable BPM",
          "icon": {
            "base64": "data:image/svg+xml;base64,PHN2ZyB3aWR0aD0iMjQiIGhlaWdodD0iMjQiIHZpZXdCb3g9IjAgMCAyNCAyNCIgZmlsbD0ibm9uZSIgeG1sbnM9Imh0dHA6Ly93d3cudzMub3JnLzIwMDAvc3ZnIj4KPHJlY3Qgd2lkdGg9IjI0IiBoZWlnaHQ9IjI0IiBmaWxsPSIjMTBDOTdGIi8+Cjx0ZXh0IHg9IjMiIHk9IjE2IiBmaWxsPSIjRkZGIiBmb250LXNpemU9IjkiIGZvbnQtZmFtaWx5PSJzZXJpZiIgZm9udC13ZWlnaHQ9ImJvbGQiPkZMT1c8L3RleHQ+Cjwvc3ZnPg=="
          }
        }
      ]
    },
    {
      "name": "DevOps & Tools",
      "icon": "Settings",
      "skills": [
        {
          "name": "CI/CD",
          "icon": {
            "base64": "data:image/svg+xml;base64,PHN2ZyB3aWR0aD0iMjQiIGhlaWdodD0iMjQiIHZpZXdCb3g9IjAgMCAyNCAyNCIgZmlsbD0ibm9uZSIgeG1sbnM9Imh0dHA6Ly93d3cudzMub3JnLzIwMDAvc3ZnIj4KPGNpcmNsZSBjeD0iNiIgY3k9IjEyIiByPSIzIiBmaWxsPSIjMTBDOTdGIi8+CjxjaXJjbGUgY3g9IjE4IiBjeT0iMTIiIHI9IjMiIGZpbGw9IiMzQzc3RjAiLz4KPGxpbmUgeDE9IjkiIHkxPSIxMiIgeDI9IjE1IiB5Mj0iMTIiIHN0cm9rZT0iIzMzODRGNiIgc3Ryb2tlLXdpZHRoPSIyIi8+CjxwYXRoIGQ9Ik0xNSA5TDE4IDEyTDE1IDE1IiBzdHJva2U9IiMzMzg0RjYiIHN0cm9rZS13aWR0aD0iMiIgZmlsbD0ibm9uZSIvPgo8L3N2Zz4="
          }
        },
        {
          "name": "Docker",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/docker/docker-original.svg"
          }
        },
        {
          "name": "Jenkins",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/jenkins/jenkins-original.svg"
          }
        },
        {
          "name": "GitLab",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/gitlab/gitlab-original.svg"
          }
        },
        {
          "name": "Liquibase",
          "icon": {
            "base64": "data:image/svg+xml;base64,PHN2ZyB3aWR0aD0iMjQiIGhlaWdodD0iMjQiIHZpZXdCb3g9IjAgMCAyNCAyNCIgZmlsbD0ibm9uZSIgeG1sbnM9Imh0dHA6Ly93d3cudzMub3JnLzIwMDAvc3ZnIj4KPHJlY3Qgd2lkdGg9IjI0IiBoZWlnaHQ9IjI0IiBmaWxsPSIjMkY4MUY3Ii8+Cjx0ZXh0IHg9IjUiIHk9IjE2IiBmaWxsPSIjRkZGIiBmb250LXNpemU9IjEwIiBmb250LWZhbWlseT0ic2VyaWYiIGZvbnQtd2VpZ2h0PSJib2xkIj5MQjwvdGV4dD4KPC9zdmc+"
          }
        },
        {
          "name": "Git",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/git/git-original.svg"
          }
        }
      ]
    },
    {
      "name": "Authentifizierung & Sicherheit",
      "icon": "Shield",
      "skills": [
        {
          "name": "Keycloak",
          "icon": {
            "base64": "data:image/svg+xml;base64,PHN2ZyB3aWR0aD0iMjQiIGhlaWdodD0iMjQiIHZpZXdCb3g9IjAgMCAyNCAyNCIgZmlsbD0ibm9uZSIgeG1sbnM9Imh0dHA6Ly93d3cudzMub3JnLzIwMDAvc3ZnIj4KPHJlY3Qgd2lkdGg9IjI0IiBoZWlnaHQ9IjI0IiBmaWxsPSIjNEQ0RDRGIi8+Cjx0ZXh0IHg9IjUiIHk9IjE2IiBmaWxsPSIjRkZGIiBmb250LXNpemU9IjEwIiBmb250LWZhbWlseT0ic2VyaWYiIGZvbnQtd2VpZ2h0PSJib2xkIj5LQzwvdGV4dD4KPC9zdmc+"
          }
        },
        {
          "name": "OAuth2/OIDC",
          "icon": {
            "base64": "data:image/svg+xml;base64,PHN2ZyB3aWR0aD0iMjQiIGhlaWdodD0iMjQiIHZpZXdCb3g9IjAgMCAyNCAyNCIgZmlsbD0ibm9uZSIgeG1sbnM9Imh0dHA6Ly93d3cudzMub3JnLzIwMDAvc3ZnIj4KPGNpcmNsZSBjeD0iMTIiIGN5PSIxMiIgcj0iMTAiIGZpbGw9IiNGRkY1NTIiLz4KPHN0YXIgY3g9IjEyIiBjeT0iMTIiIHI9IjQiIGZpbGw9IiMzMzMiLz4KPC9zdmc+"
          }
        }
      ]
    },
    {
      "name": "Datenbank & Architektur",
      "icon": "Database",
      "skills": [
        {
          "name": "PostgreSQL",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/postgresql/postgresql-original.svg"
          }
        },
        {
          "name": "MongoDB",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/mongodb/mongodb-original.svg"
          }
        },
        {
          "name": "MySQL",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/mysql/mysql-original.svg"
          }
        },
        {
          "name": "Domain-Driven Design",
          "icon": {
            "base64": "data:image/svg+xml;base64,PHN2ZyB3aWR0aD0iMjQiIGhlaWdodD0iMjQiIHZpZXdCb3g9IjAgMCAyNCAyNCIgZmlsbD0ibm9uZSIgeG1sbnM9Imh0dHA6Ly93d3cudzMub3JnLzIwMDAvc3ZnIj4KPHJlY3Qgd2lkdGg9IjI0IiBoZWlnaHQ9IjI0IiBmaWxsPSIjNkY0MkMxIi8+Cjx0ZXh0IHg9IjMiIHk9IjE2IiBmaWxsPSIjRkZGIiBmb250LXNpemU9IjEwIiBmb250LWZhbWlseT0ic2VyaWYiIGZvbnQtd2VpZ2h0PSJib2xkIj5ERDs8L3RleHQ+Cjwvc3ZnPg=="
          }
        },
        {
          "name": "Hexagonale Architektur",
          "icon": {
            "base64": "data:image/svg+xml;base64,PHN2ZyB3aWR0aD0iMjQiIGhlaWdodD0iMjQiIHZpZXdCb3g9IjAgMCAyNCAyNCIgZmlsbD0ibm9uZSIgeG1sbnM9Imh0dHA6Ly93d3cudzMub3JnLzIwMDAvc3ZnIj4KPHBvbHlnb24gcG9pbnRzPSIxMiwyIDIwLDYgMjAsMTggMTIsMjIgNCwxOCA0LDYiIGZpbGw9IiNFRjQ0NDQiLz4KPHN0YXIgY3g9IjEyIiBjeT0iMTIiIHI9IjMiIGZpbGw9IiNGRkYiLz4KPC9zdmc+"
          }
        }
      ]
    },
    {
      "name": "Frontend-Technologien",
      "icon": "Monitor",
      "skills": [
        {
          "name": "React",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/react/react-original.svg"
          }
        },
        {
          "name": "Angular",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/angularjs/angularjs-original.svg"
          }
        },
        {
          "name": "Formio",
          "icon": {
            "base64": "data:image/svg+xml;base64,PHN2ZyB3aWR0aD0iMjQiIGhlaWdodD0iMjQiIHZpZXdCb3g9IjAgMCAyNCAyNCIgZmlsbD0ibm9uZSIgeG1sbnM9Imh0dHA6Ly93d3cudzMub3JnLzIwMDAvc3ZnIj4KPHJlY3Qgd2lkdGg9IjI0IiBoZWlnaHQ9IjI0IiBmaWxsPSIjNDI5RkY0Ii8+Cjx0ZXh0IHg9IjQiIHk9IjE2IiBmaWxsPSIjRkZGIiBmb250LXNpemU9IjEwIiBmb250LWZhbWlseT0ic2VyaWYiIGZvbnQtd2VpZ2h0PSJib2xkIj5GTzwvdGV4dD4KPC9zdmc+"
          }
        }
      ]
    }
  ],
  "achievements": [
    {
      "icon": "Users",
      "number": "5+",
      "title": "Jahre Erfahrung",
      "description": "Spezialisiert auf Backend-Entwicklung und Softwarearchitektur"
    },
    {
      "icon": "Built",
      "number": "6+",
      "title": "Gelieferte Projekte",
      "description": "Erfolgreich gelieferte Banken- und Versicherungslösungen"
    }
  ],
  "contactInfo": {
    "title": "Kontaktieren Sie Mich",
    "description": "Ich bin immer daran interessiert, neue Chancen, innovative Projekte zu besprechen und mich mit anderen Technologie-Enthusiasten zu vernetzen.",
    "locationTitle": "Standort",
    "locationDescription": "Verfügbar für Remote-Arbeit und Reisen",
    "cta": {
      "title": "Bereit zu Beginnen?",
      "description": "Lassen Sie uns besprechen, wie ich bei der Architektur von Lösungen für Ihr nächstes großes Projekt helfen kann.",
      "button1": "Gespräch Starten",
      "button2": "Anruf Vereinbaren"
    },
    "responseTime": "Antwortzeit: Normalerweise innerhalb von 24 Stunden",
    "email": "mohamed.el.abed.24@gmail.com",
    "linkedin": "www.linkedin.com/in/mohamed-iben-el-abed",
    "github": "github.com/Makros-24",
    "twitter": "",
    "phone": "+216-50-622-368",
    "location": "Sousse, Tunesien",
    "methods": {
      "email": {
        "description": "Schreiben Sie mir eine E-Mail"
      },
      "linkedin": {
        "description": "Vernetzen Sie sich auf LinkedIn"
      },
      "github": {
        "description": "Sehen Sie meinen Code an"
      },
      "twitter": {
        "description": "Folgen Sie mir auf X"
      }
    }
  },
  "footer": {
    "copyrightName": "Mohamed IBEN EL ABED",
    "copyrightYear": 2024,
    "madeWithText": "Mit Leidenschaft für Technologie und Innovation erstellt."
  }
}
