{
  "personalInfo": {
    "name": "Mohamed IBEN EL ABED",
    "title": "Développeur Backend Senior & Lead Technique",
    "description": "Développeur Backend expérimenté avec une formation en réseaux, excellent en JAVA et BPMN. Parcours éprouvé dans les secteurs bancaire et assurantiel, livrant des solutions optimisées pour les contextes retail et corporate avec plus de 5 ans d'expérience.",
    "avatar": {
      "url": "https://lh3.googleusercontent.com/d/1JxR6_v1q40TSt5FzgJdKvEeONXoe2Mk1"
    },
    "resumeUrl": "https://drive.google.com/file/d/1GlttHmMtXq8A2D1LwwdqaCg-NElsiXKS/view?usp=drive_link"
  },
  "about": {
    "title": "À Propos de Moi",
    "description": "Passionné par la création de solutions innovantes qui comblent le fossé entre les exigences techniques complexes et les expériences utilisateur élégantes. Je me spécialise dans l'architecture de systèmes évolutifs qui favorisent le succès commercial.",
    "skillsTitle": "Technologies",
    "achievementsTitle": "Réalisations Clés"
  },
  "work": {
    "title": "Projets Phares",
    "description": "Une sélection de projets qui démontrent mon expertise en architecture de solutions, développement full-stack et infrastructure cloud."
  },
  "projects": [
    {
      "id": 1,
      "title": "Plateforme Bancaire Corporate Bankerise",
      "company": "Proxym Group",
      "role": "Développeur Backend Senior & Lead Technique",
      "description": "Maintenance et évolution d'une solution bancaire corporate complète servant des clients entreprises, construite avec les principes de Domain-Driven Design et d'Architecture Hexagonale.",
      "markdownDescription": "# Développeur Backend Senior & Lead Technique - Plateforme Bancaire Corporate Bankerise\n\n## Aperçu du Projet\n\nEn tant que Lead Technique pour la Plateforme Bancaire Corporate Bankerise, j'ai dirigé l'évolution d'un système critique permettant aux entreprises de gérer des comptes multi-devises, des paiements nationaux/internationaux, du financement commercial et des rapports complets via une interface unifiée. La plateforme relève le défi central du traitement de transactions à forte valeur avec des hiérarchies d'approbation complexes tout en maintenant l'efficacité opérationnelle et la conformité réglementaire.\n\nConstruite sur Domain-Driven Design et Architecture Hexagonale, le système traite des millions de dollars de volume de transactions quotidiennes sur plusieurs marchés. **Impact Business** : Réduction de l'implémentation client de 8-12 mois à 2-3 mois (réduction de 80%), permettant une intégration 4x plus rapide tout en maintenant les standards de qualité.\n\n<!-- DIAGRAM_PLACEHOLDER: Architecture Système Bancaire Corporate - Couches architecture hexagonale, limites d'agrégats, adaptateurs intégration Sopra, flux événements CQRS -->\n\n## Architecture Technique\n\nArchitecturée avec Domain-Driven Design et Architecture Hexagonale, séparant les contextes délimités pour Paiements, Comptes, Prêts, Financement Commercial et Rapports. Les agrégats domaine appliquent les règles métier avec communication inter-agrégats pilotée par événements. Intégrée avec Sopra Banking Platform et systèmes propriétaires via couche adaptateur, abstrayant les complexités SOAP/REST tout en permettant le changement de fournisseur. Implémentation CQRS pour requêtes complexes et event sourcing pour pistes d'audit. Migrations base de données gérées via Liquibase pour déploiements sans interruption.\n\n## Responsabilités Clés\n\n- **Conception Architecture** : Conception et maintien architecture hexagonale avec frontières claires domaine/application/infrastructure\n- **Modélisation Domaine** : Animation sessions modélisation pour capturer workflows bancaires complexes en modèles domaine riches avec limites d'agrégats appropriées\n- **Optimisation Performance** : Refactorisation traitement transactions, réduction approbation paiements de 3.5s à 800ms par optimisation requêtes\n- **Moteur Workflows** : Conception système approbation multi-niveaux flexible supportant règles métier complexes (seuils montants, hiérarchies rôles, double autorisation)\n- **Couche Intégration** : Architecture couche adaptateurs Sopra Banking Platform, abstrayant complexités API de logique domaine\n- **Leadership Qualité** : Établissement couverture code 80% avec enforcement ArchUnit, prévention violations architecture\n- **Mentorat Équipe** : Passage équipe de 5 à 10 ingénieurs en transitionnant vers rôle architecte, maintien qualité code via revues et pair programming\n- **Livraison Fonctionnalités** : Implémentation initiation paiements, gestion comptes, origination prêts et modules reporting réglementaire\n\n## Réalisations & Impact Clés\n\n- **Réduction 80% Time-to-Market** : Transformation implémentation de 8-12 mois à 2-3 mois via architecture modulaire et personnalisation pilotée configuration\n- **Passage Échelle Équipe** : Croissance équipe développement de 5 à 10 ingénieurs tout en maintenant 80% couverture code et zéro violation architecture\n- **Cadence Release Rapide** : Livraison 1-2 releases chaque sprint 3 semaines vers 3 équipes intégration parallèles\n- **Déploiements Sans Interruption** : Activation déploiements production sans interruption service\n- **Excellence Architecture** : Automatisation validation architecture avec ArchUnit dans pipeline CI/CD\n\n## Points Techniques Saillants\n\n### Système Événements Domaine\nConception système événements élégant pour communication inter-agrégats avec événements publiés dans limites transactions, handlers asynchrones pour cohérence éventuelle, et capacité rejeu événements pour débogage et audit.\n\n<!-- CODE_PLACEHOLDER: Publication PaymentInitiatedEvent depuis agrégat Payment et traitement dans contexte Notification -->\n\n### Personnalisation Pilotée Configuration\nConstruction moteur configuration flexible permettant personnalisation spécifique client sans changements code : règles workflows approbation, formules calcul frais, visibilité champs UI et isolation données multi-tenant.\n\n### Ingénierie Performance\nOptimisation chemins critiques : approbation paiement de 3.5s à 800ms, pooling connexions HikariCP, caching stratégique pour données référence (taux change, frais) et traitement batch pour opérations bulk.\n\n## Défis & Solutions\n\n**Défi** : Workflows approbation nécessitaient changements code par politiques client.\n\n**Solution** : Conception moteur règles flexible utilisant Specification Pattern avec machine états pour transitions. Règles métier définies déclarativement en configuration, permettant utilisateurs non-techniques personnaliser flux.\n\n**Impact** : Réduction personnalisation de 2-3 semaines développement à 2-3 heures configuration par client.\n\n---\n\n**Défi** : Chaque client utilise différents systèmes bancaires core (Sopra, propriétaires) avec protocoles variés (SOAP/REST) et formats données.\n\n**Solution** : Implémentation pattern adaptateur Architecture Hexagonale avec Banking API Port. Création adaptateurs spécifiques système gérant différences protocoles et Anti-Corruption Layer pour traduction modèles.\n\n**Impact** : Intégration 3 systèmes bancaires core sans changements logique domaine. Réduction temps intégration de 3 mois à 3 semaines par système.\n\n---\n\n**Défi** : Croissance équipe (5 à 10 développeurs) risquait cohérence architecture et qualité code.\n\n**Solution** : Automatisation gouvernance avec ArchUnit dans CI/CD, intégration complète avec Architecture Decision Records, revues obligatoires avec checklist architecture et réunions guild hebdomadaires.\n\n**Impact** : Maintien 80% couverture et zéro violations malgré croissance équipe 100%.\n\n## Équipe & Collaboration\n\nDirigé équipe cross-fonctionnelle de 10 ingénieurs (6 backend, 2 frontend, 2 QA) organisés autour contextes délimités en Agile/Scrum avec sprints 3 semaines. Établi culture revue code rigoureuse centrée sur modélisation domaine et alignement architecture. Organisation sessions techniques hebdomadaires sur concepts DDD et design patterns. Collaboration avec Product Owners sur conceptions techniques et équipes Intégration pour déploiements fluides.\n\n<!-- SCREENSHOT_PLACEHOLDER: Tableau de bord gestion workflows paiements avec files approbation et monitoring transactions -->",
      "image": {
        "url": "https://lh3.googleusercontent.com/d/1AFqRxn2BtHNQ2yQm5Sz3uBtng-TfNq90"
      },
      "technologies": [
        {
          "name": "Java",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/java/java-original.svg"
          }
        },
        {
          "name": "Spring Boot",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/spring/spring-original.svg"
          }
        },
        {
          "name": "PostgreSQL",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/postgresql/postgresql-original.svg"
          }
        },
        {
          "name": "Docker",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/docker/docker-original.svg"
          }
        },
        {
          "name": "Keycloak",
          "icon": {
            "url": "https://www.keycloak.org/resources/images/logo.svg"
          }
        },
        {
          "name": "Liquibase",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon@latest/icons/liquibase/liquibase-original.svg"
          }
        },
        {
          "name": "Domain-Driven Design",
          "icon": {
            "url": "https://example.com/ddd-icon.svg"
          }
        },
        {
          "name": "Architecture Hexagonale",
          "icon": {
            "url": "https://www.svgrepo.com/show/44395/hexagon.svg"
          }
        }
      ],
      "links": {
        "live": "#",
        "github": "#"
      }
    },
    {
      "id": 2,
      "title": "Banque Numérique Retail BNA",
      "company": "Proxym Group",
      "role": "Spécialiste Intégration Produit",
      "description": "Contribution au développement d'une application Digital Retail pour BNA, exploitant la plateforme bancaire Bankerise de Proxym. Leadership de la transformation numérique dans le secteur bancaire avec des solutions innovantes.",
      "markdownDescription": "# Spécialiste Intégration Produit - Banque Numérique Retail BNA\n\n## Aperçu du Projet\n\nEn tant que Spécialiste Intégration Produit pour BNA (Banque Nationale Agricole) Retail Banking, j'ai dirigé la transformation numérique permettant des services bancaires retail modernes via canaux web et mobile. Le défi impliquait connecter systèmes bancaires core legacy avec attentes banking numérique tout en maintenant continuité opérationnelle. Livraison réussie plateforme fonctionnelle complète, réduisant dépendance agences et permettant accès banking numérique 24/7.\n\n<!-- DIAGRAM_PLACEHOLDER: Architecture Intégration BNA - Intégration plateforme Bankerise avec BNA core banking, composants digital booster, API gateway, pipeline multi-environnements -->\n\n## Architecture Technique\n\nIntégration accélérateur banking numérique dans plateforme Bankerise, connexion au core banking propriétaire BNA via couche adaptateur supportant protocoles duaux (SOAP/REST). Implémentation pattern API gateway pour accès unifié core banking. Construction intégrations résilientes utilisant Circuit Breaker (Resilience4j), logique retry exponentielle et idempotence pour retries sécurisés. Automatisation onboarding client via workflows BPMN avec persistance état.\n\n## Responsabilités Clés\n\n- **Intégration Core Banking** : Conception adaptateurs pour requêtes comptes, traitement transactions et consultations soldes gérant différences protocoles SOAP/REST\n- **Développement API** : Création API RESTful pour gestion comptes, virements fonds, paiements factures et historique transactions\n- **Onboarding Client** : Développement workflow multi-étapes (vérification KYC, upload documents, ouverture compte, émission carte) comme processus BPMN\n- **Implémentation CI/CD** : Configuration pipelines GitLab CI/CD pour déploiement automatisé vers Dev, SIT, UAT et Production avec gates approbation\n- **Gestion Configuration** : Construction système configuration spécifique environnements avec profils Spring et secrets chiffrés\n- **Mentorat Équipe** : Intégration 3 développeurs via pair programming, revues code et sessions techniques\n- **Traduction Exigences** : Collaboration avec analystes business pour convertir exigences fonctionnelles en spécifications techniques\n\n## Réalisations & Impact Clés\n\n- **Lancement Plateforme** : Livraison plateforme banking numérique intégrée dans délais, permettant lancement service banking numérique BNA\n- **Efficacité Déploiement** : Réduction temps déploiement de 2 jours à 2 heures via pipelines CI/CD automatisés\n- **Onboarding Numérique** : Transformation ouverture compte de 3-5 jours (visite agence) en processus numérique même jour\n- **Fiabilité Intégration** : Atteinte 99.5% uptime pour intégrations core banking via patterns résilients\n- **Productivité Équipe** : Établissement pratiques transfert connaissances améliorant productivité équipe\n\n## Points Techniques Saillants\n\n### Intégration Double-Protocole\nImplémentation couche adaptateur unifiée supportant SOAP (Apache CXF avec JAXB) et REST (Spring RestTemplate avec Jackson) avec interface commune définissant opérations protocol-agnostiques et mapping exceptions unifié.\n\n<!-- CODE_PLACEHOLDER: Pattern Adaptateur Core Banking avec implémentations SOAP/REST, configuration circuit breaker, logique retry -->\n\n### Onboarding Multi-Étapes\nConception workflow BPMN : Enregistrement (vérification email/téléphone) → KYC (upload documents, reconnaissance faciale) → Sélection Compte (choix produit, acceptation termes) → Intégration Core Banking → Émission Carte avec persistance état et reprenabilité.\n\n### Configuration Environnements\nConstruction système configuration robuste utilisant profils Spring (dev/sit/uat/prod), variables GitLab CI/CD externalisées, secrets chiffrés et endpoints spécifiques environnements.\n\n## Défis & Solutions\n\n**Défi** : Services SOAP legacy avec schémas XML complexes, gestion erreurs incohérente et documentation pauvre risquaient couplage serré.\n\n**Solution** : Implémentation Anti-Corruption Layer avec adaptateurs dédiés traduisant entre core banking et modèles domaine. Création tests intégration complets avec réponses SOAP mockées.\n\n**Impact** : Isolation plateforme de complexité core banking. Problèmes intégration contenus dans couche adaptateur.\n\n---\n\n**Défi** : Déploiements manuels vers 4 environnements étaient sujets erreurs, prenaient 2 jours et nécessitaient coordination extensive.\n\n**Solution** : Implémentation GitLab CI/CD avec builds automatisés, jobs spécifiques environnements avec gates approbation, déploiement Docker, tests smoke post-déploiement et procédures rollback.\n\n**Impact** : Temps déploiement de 2 jours à 2 heures. Élimination erreurs. Boucles feedback plus rapides.\n\n---\n\n**Défi** : Expansion rapide équipe avec développeurs manquant expérience Spring Boot, Bankerise et domaine BNA.\n\n**Solution** : Création onboarding complet : documentation architecture, guide standards codage, pair programming, revues code éducatives et discussions techniques hebdomadaires.\n\n**Impact** : Nouveaux développeurs productifs en 2-3 semaines. Haute qualité code maintenue. Culture partage connaissances établie.\n\n## Équipe & Collaboration\n\n8 membres équipe (5 backend, 2 frontend, 1 QA) en Scrum avec sprints 2 semaines. Collaboration étroite avec équipe IT BNA, équipe plateforme Proxym et fournisseurs externes. Revues pair obligatoires centrées sur patterns intégration et gestion erreurs. Sessions techniques hebdomadaires sur patterns intégration et architecture plateforme.\n\n<!-- SCREENSHOT_PLACEHOLDER: Application BNA Retail Banking - tableau de bord client, vue d'ensemble compte, historique transactions, interfaces virement fonds -->",
      "image": {
        "url": "https://lh3.googleusercontent.com/d/1dxSiXL55Z3ZHNt0lydoLyiEKwy1GvRob"
      },
      "technologies": [
        {
          "name": "Java",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/java/java-original.svg"
          }
        },
        {
          "name": "Spring Boot",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/spring/spring-original.svg"
          }
        },
        {
          "name": "API REST",
          "icon": {
            "url": "https://www.svgrepo.com/svg/447473/rest-api"
          }
        },
        {
          "name": "CI/CD",
          "icon": {
            "url": "https://www.svgrepo.com/svg/445634/cicd"
          }
        },
        {
          "name": "Docker",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/docker/docker-original.svg"
          }
        },
        {
          "name": "PostgreSQL",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/postgresql/postgresql-original.svg"
          }
        }
      ],
      "links": {
        "live": "#",
        "github": "#"
      }
    },
    {
      "id": 3,
      "title": "Application Web Bancaire BICICI",
      "company": "Proxym Group",
      "role": "Lead Technique",
      "description": "Direction du développement d'une application web pour la Banque Internationale pour le Commerce et l'Industrie de Côte d'Ivoire afin d'améliorer les services pour les agents bancaires.",
      "markdownDescription": "# Lead Technique - Plateforme Agent Banking BICICI\n\n## Aperçu du Projet\n\nEn tant que Lead Technique pour Plateforme Agent Banking BICICI (Banque Internationale pour le Commerce et l'Industrie de la Côte d'Ivoire), j'ai dirigé développement application web complète révolutionnant services bancaires via 250+ agents à travers Côte d'Ivoire. La plateforme a autonomisé agents pour fournir services essentiels dans zones reculées, élargissant significativement inclusion financière. Construite avec Automatisation Processus Métier intelligente utilisant Flowable BPMN, elle a automatisé workflows complexes nécessitant auparavant multiples étapes manuelles et jours traitement. **Impact Business** : Déploiement réussi servant 250+ agents, permettant milliers ouvertures comptes mensuelles et apportant banking aux communautés précédemment non bancarisées.\n\n<!-- DIAGRAM_PLACEHOLDER: Architecture Plateforme Agent BICICI - Moteur workflow BPMN, constructeur formulaires Formio, portail agent, intégration mobile, connectivité core banking -->\n\n## Architecture Technique\n\nConstruction sur Flowable BPM pour orchestration processus métier avec Formio pour configuration formulaires dynamiques sans code. Portail agent livré via API RESTful avec accès basé rôles hiérarchique (Keycloak OAuth2/OIDC). Elasticsearch a alimenté recherche agents et clients. Données transactionnelles dans PostgreSQL avec gestion sessions Redis. Déploiement comme conteneurs Docker sur infrastructure AWS.\n\n## Responsabilités Clés\n\n- **Conception Workflow BPMN** : Architecture automation intelligente pour ouverture compte avec workflows multi-étapes, branchement conditionnel, approbations et gestion erreurs\n- **Portail Agent** : Construction portail web complet avec tableaux bord, gestion clients, traitement transactions et reporting\n- **Formulaires Dynamiques** : Intégration Formio permettant utilisateurs business modifier formulaires onboarding clients sans déploiement code\n- **Intégration Core Banking** : Connexion au système BICICI pour création comptes, consultations soldes et traitement transactions\n- **Architecture Sécurité** : Implémentation permissions hiérarchiques (super agents, agents, superviseurs) avec contrôles accès fins\n- **Leadership Déploiement** : Gestion déploiements end-to-end à travers SIT, UAT et Production avec stratégies zéro-interruption\n- **Gestion Stakeholders Techniques** : Animation discussions avec stakeholders BICICI sur estimations et faisabilité technique\n- **Qualité Code** : Conduite revues centrées sur best practices BPMN, sécurité et performance\n\n## Réalisations & Impact Clés\n\n- **Déploiement 250+ Agents** : Intégration réussie 250+ agents à travers Côte d'Ivoire avec zéro incidents production\n- **Traitement Automatisé** : Réduction onboarding client de 5-7 jours (manuel) à même jour via automation BPMN\n- **Plateforme Scalable** : Conception pour gérer 1000+ agents concurrents avec temps transaction <2s\n- **Succès Multi-Environnements** : Gestion déploiements complexes à travers environnements avec isolation et stratégies migration appropriées\n\n## Points Techniques Saillants\n\n### Workflows Flowable BPMN\nImplémentation processus sophistiqués : onboarding client avec vérification KYC, approbations multi-niveaux, gestion erreurs avec transactions compensation, monitoring processus et pistes audit. Découpage workflows en sous-processus réutilisables avec patterns boundary erreurs et dashboard monitoring pour processus bloqués.\n\n<!-- CODE_PLACEHOLDER: Workflow BPMN ouverture compte avec service tasks, user tasks, gateways, gestion erreurs -->\n\n### Formulaires Dynamiques Formio\nCréation système flexible permettant utilisateurs business concevoir formulaires visuellement sans codage, définir règles validation et logique conditionnelle, supporter langues multiples avec layouts RTL et exporter/importer configurations.\n\n### Système Hiérarchie Agents\nImplémentation structure multi-tiers avec permissions cascading et tracking métriques performance, permettant supervision et gestion performance.\n\n## Défis & Solutions\n\n**Défi** : Ouverture compte nécessitait orchestration 15+ étapes incluant validation, appels core banking, vérification documents et approbations.\n\n**Solution** : Découpage workflows en sous-processus réutilisables, implémentation patterns boundary erreurs et création dashboard monitoring pour processus bloqués avec retry automatique pour échecs transitoires.\n\n**Impact** : Atteinte taux complétion réussi 99%.\n\n## Équipe & Collaboration\n\n6 membres équipe (4 backend, 1 frontend, 1 DevOps) en Scrum avec sprints 3 semaines, standups quotidiens et démos sprint aux stakeholders BICICI. Animation réunions alignement technique bi-hebdomadaires avec équipe IT BICICI.\n\n<!-- SCREENSHOT_PLACEHOLDER: Portail Agent BICICI - tableau bord, recherche clients, formulaire ouverture compte, historique transactions -->",
      "image": {
        "url": "https://lh3.googleusercontent.com/d/1VfZAgsp25SyrMgv2FghKFdnJO8m7JEBs"
      },
      "technologies": [
        {
          "name": "Java",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/java/java-original.svg"
          }
        },
        {
          "name": "Spring Boot",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/spring/spring-original.svg"
          }
        },
        {
          "name": "Flowable BPMN",
          "icon": {
            "url": "https://www.svgrepo.com/show/395899/process.svg"
          }
        },
        {
          "name": "Formio",
          "icon": {
            "url": "https://example.com/formio-icon.svg"
          }
        },
        {
          "name": "PostgreSQL",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/postgresql/postgresql-original.svg"
          }
        },
        {
          "name": "Docker",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/docker/docker-original.svg"
          }
        }
      ],
      "links": {
        "live": "#",
        "github": "#"
      }
    },
    {
      "id": 4,
      "title": "Plateforme d'Assurance Numérique Insurise®",
      "company": "Proxym Group",
      "role": "Développeur Backend",
      "description": "Développement d'une solution d'assurance numérique omnicanale innovante pour améliorer l'expérience client, servant plus de 20 000 utilisateurs.",
      "markdownDescription": "# Développeur Backend - Plateforme Assurance Numérique Insurise®\n\n## Aperçu du Projet\n\nEn tant que Développeur Backend pour plateforme Insurise®, j'ai construit solution assurance numérique omnicanale innovante transformant interactions clients pour 3 clients assurance majeurs (BH Assurance, Comar, Star Assurance) en Tunisie. La plateforme a révolutionné industrie en permettant devis numériques, achats polices, gestion sinistres et tracking portefeuille via canaux seamless. Servant 20 000+ utilisateurs avec 1000-2000 utilisateurs actifs quotidiens, elle gère assurance auto, habitation, responsabilité professionnelle et voyage avec génération devis temps réel et traitement sinistres numérique. **Impact Business** : Réduction émission polices de 5-7 jours à émission numérique instantanée. Transformation traitement sinistres de 15-30 jours à 3-5 jours.\n\n<!-- DIAGRAM_PLACEHOLDER: Architecture Plateforme Insurise - Microservices, API gateway, documents MongoDB, transactions PostgreSQL, caching Redis, accès omnicanal -->\n\n## Architecture Technique\n\nConstruction backend modulaire avec services orientés domaine pour devis, souscriptions, sinistres, paiements et gestion clients. Stratégie base données duale : PostgreSQL pour données transactionnelles assurance, MongoDB pour stockage documents. Redis cache données haute fréquence (tarifs, configurations). Elasticsearch alimente recherche clients, polices et sinistres. Intégration avec passerelles paiement, fournisseurs SMS/email et moteurs tarification tiers via API RESTful.\n\n## Responsabilités Clés\n\n- **Développement Plateforme** : Construction infrastructure core incluant moteur devis, gestion souscriptions, traitement sinistres et workflows paiements\n- **Couche API Omnicanale** : Conception API supportant web, mobile et portails agents avec expérience cohérente\n- **Moteur Devis** : Implémentation moteur tarification temps réel calculant primes basées sur facteurs risque, options couverture et règles tarification spécifiques clients\n- **Workflow Sinistres** : Développement processus end-to-end (soumission, upload documents, affectation expert, chaînes approbation, règlement)\n- **Intégration Paiements** : Connexion multiples passerelles (Paymee, ClickToPay) pour souscriptions, renouvellements et mensualités\n- **Conception Base Données** : Architecture schéma hybride optimisant transactions ACID (PostgreSQL) et documents flexibles (MongoDB)\n- **POC Clients** : Préparation et présentation Proof of Concepts démontrant capacités plateforme aux clients potentiels\n\n## Réalisations & Impact Clés\n\n- **20K+ Utilisateurs** : Passage échelle à 20 000+ utilisateurs avec 1000-2000 actifs quotidiens maintenant temps réponse <2s\n- **3 Clients Majeurs** : Livraison solutions personnalisées à BH Assurance, Comar et Star Assurance\n- **Moteur Multi-Assurance** : Implémentation moteur produits flexible supportant 4 types assurance avec règles tarification uniques\n- **Réduction Temps 95%** : Réduction émission polices de jours à minutes via automation\n- **Cohérence Omnicanale** : Activation expérience seamless à travers canaux web, mobile et agents\n\n## Points Techniques Saillants\n\n### Moteur Devis avec Système Règles\nConstruction moteur tarification sophistiqué avec évaluation risque basée profil client et sélection couverture, règles tarification configurables par produit et client, calcul prime temps réel avec application taxes/frais et support multi-devises.\n\n<!-- CODE_PLACEHOLDER: Service Moteur Devis - calcul risque, évaluation règles tarification, calcul prime avec builder pattern -->\n\n### Workflow Traitement Sinistres\nSystème numérique complet 6 étapes : Soumission (détails incident, documentation) → Validation (couverture police, éligibilité) → Affectation (allocation intelligente expert) → Évaluation (upload photos, revue expert) → Approbation (workflow multi-niveaux) → Règlement (paiement, ajustement police).\n\n### Stockage Données Optimisé\nPostgreSQL pour transactions structurées (polices, clients, paiements), MongoDB pour documents flexibles (PDF, photos sinistres, contrats), Redis pour cache haute fréquence (tarifs, configs, sessions), Elasticsearch pour index recherche rapide.\n\n## Défis & Solutions\n\n**Défi** : Chaque type assurance (auto, habitation, voyage, professionnelle) a facteurs tarification uniques, options couverture et exigences réglementaires.\n\n**Solution** : Conception moteur produits flexible avec règles tarification configurables, templates couverture et schémas validation. Utilisation Strategy Pattern pour logique spécifique type. Externalisation règles business en configuration.\n\n**Impact** : Intégration 4 types assurance en 18 mois sans changements architecture. Activation lancements produits en semaines vs mois.\n\n---\n\n**Défi** : Calcul prime impliquait évaluation risque complexe, règles tarification, réductions et taxes—potentiellement lent.\n\n**Solution** : Implémentation stratégie caching multi-couches Redis pour tarifs et configurations. Optimisation moteur tarification avec évaluation lazy. Pré-calcul profils risque communs. Ajout calcul async pour scénarios complexes.\n\n**Impact** : Temps réponse <800ms pour 95% devis. Réduction 70% requêtes base données.\n\n## Équipe & Collaboration\n\n10 membres équipe produit (7 backend, 2 frontend, 1 QA) en Agile avec sprints 2 semaines, standups quotidiens, rétrospectives et démos sprint. Collaboration avec analystes business assurance, designers UX et ingénieurs QA. Organisation sessions techniques sur microservices et architecture plateforme.\n\n<!-- SCREENSHOT_PLACEHOLDER: Portail client Insurise - tableau bord polices, génération devis temps réel, soumission sinistres, historique paiements -->",
      "image": {
        "url": "https://lh3.googleusercontent.com/d/1k3u470MWuVmRHhGeLoZhjl1h-HcEu_9a"
      },
      "technologies": [
        {
          "name": "Java",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/java/java-original.svg"
          }
        },
        {
          "name": "Spring Boot",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/spring/spring-original.svg"
          }
        },
        {
          "name": "PostgreSQL",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/postgresql/postgresql-original.svg"
          }
        },
        {
          "name": "MongoDB",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/mongodb/mongodb-original.svg"
          }
        },
        {
          "name": "API REST",
          "icon": {
            "url": "https://www.svgrepo.com/svg/447473/rest-api"
          }
        },
        {
          "name": "Docker",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/docker/docker-original.svg"
          }
        }
      ],
      "links": {
        "live": "#",
        "github": "#"
      }
    },
    {
      "id": 5,
      "title": "Transformation DevOps CHIFCO",
      "company": "CHIFCO",
      "role": "Ingénieur DevOps",
      "description": "Direction transformation culturelle DevOps réduisant temps déploiement de 3 jours et temps d'arrêt de 1-2 jours à 5-10 minutes. Implémentation pipelines CI/CD automatisés avec Jenkins et GitLab CI, conteneurisation applications avec Docker et automatisation infrastructure avec Ansible.",
      "markdownDescription": "# Ingénieur DevOps - Transformation DevOps CHIFCO\n\n## Aperçu du Projet\n\nEn tant qu'Ingénieur DevOps chez CHIFCO, j'ai dirigé initiative transformative intégrant méthodologies DevOps dans culture développement. Le défi : déploiements manuels nécessitaient 3-5 jours avec coordination extensive, rollbacks fréquents et 1-2 jours temps d'arrêt par version. Travaillant avec Architecte Logiciel et Administrateur Système, j'ai mené implémentation technique révolutionnant livraison logicielle via automatisation CI/CD complète, conteneurisation et infrastructure as code. **Impact Business** : Réduction déploiement de 3-5 jours à heures. Diminution temps d'arrêt de 1-2 jours à 5-10 minutes. Activation versions hebdomadaires au lieu de trimestrielles. Transformation culture de \"peur déploiement\" à \"déployer avec confiance et fréquemment\".\n\n<!-- DIAGRAM_PLACEHOLDER: Architecture Pipeline DevOps CHIFCO - Dépôts GitLab/GitHub, Jenkins CI/CD, registre Docker, automatisation Ansible, stack monitoring, environnements déploiement -->\n\n## Architecture Technique\n\nConstruction orchestration CI/CD complète avec Jenkins (build automatisé, test, déploiement) et alternative GitLab CI. Conteneurisation applications full-stack via Docker assurant cohérence cross-environnement. Automatisation provisioning infrastructure et déploiement avec playbooks Ansible. Contrôle version via GitLab avec stratégies branching et workflows merge requests.\n\n## Responsabilités Clés\n\n- **Architecture Pipeline CI/CD** : Conception pipelines complets avec build automatisé, test, quality gates et étapes déploiement\n- **Conteneurisation Applications** : Dockerisation applications full-stack créant Dockerfiles et configurations docker-compose\n- **Administration Jenkins** : Configuration et maintenance serveur, configuration jobs, gestion plugins, implémentation sécurité\n- **Automatisation Infrastructure** : Développement playbooks Ansible pour provisioning, déploiement et gestion configuration\n- **GitLab CI/CD** : Configuration pipelines, implémentation setup runners, gestion déploiement environnements\n- **Mécanismes Rollback** : Implémentation rollback automatisé pour déploiements échoués\n- **Scripting Shell** : Création scripts pour orchestration déploiement, health checks et maintenance\n- **Leadership Culturel** : Animation formations, création documentation, mentorat équipe sur pratiques DevOps\n\n## Réalisations & Impact Clés\n\n- **Réduction Temps 95%** : Réduction déploiement de 3-5 jours à heures via automatisation complète\n- **Réduction Downtime 95%** : Réduction temps d'arrêt de 1-2 jours à 5-10 minutes via déploiements rolling et health checks\n- **Fréquence Versions** : Activation versions hebdomadaires au lieu de trimestrielles, accélération time-to-market\n- **Zéro Étapes Manuelles** : Élimination toutes étapes déploiement manuelles, réduction erreurs humaines\n- **Productivité Développeurs** : Libération développeurs des préoccupations déploiement pour focus fonctionnalités\n- **Transformation Culturelle** : Transformation mindset équipe en 3 mois avec augmentation demandes automatisation\n\n## Points Techniques Saillants\n\n### Pipeline-as-Code Jenkins\nImplémentation Jenkinsfiles basés Groovy avec pipeline multi-étapes : Build (compilation, tests unitaires) → Qualité Code (SonarQube, coverage) → Package (images Docker) → Déploiement Staging (smoke tests) → Approbation Manuelle → Déploiement Production (rolling, health checks) → Post-Déploiement (vérification, notifications).\n\n<!-- CODE_PLACEHOLDER: Script Pipeline Jenkins - Jenkinsfile avec pipeline multi-étapes, build Docker, tests automatisés, déploiement multi-environnements -->\n\n### Infrastructure-as-Code Ansible\nConstruction approche systématique avec rôles pour serveurs web/application/base données, variables pour config spécifique environnement, handlers pour redémarrages services et opérations idempotentes assurant répétabilité.\n\n### Optimisation Docker\nImplémentation builds multi-étages séparant étapes build/runtime, images production minimales réduisant surface attaque, caching builds pour vitesse et health checks intégrés.\n\n## Défis & Solutions\n\n**Défi** : Équipes développeurs et opérations sceptiques DevOps, craignant complexité et échecs.\n\n**Solution** : Transformation graduelle : Démarrage avec pipeline CI simple pour quick wins, démonstration déploiements automatisés réussis, animation ateliers hands-on avec support continu et publicité améliorations.\n\n**Impact** : Adhésion équipe complète en 3 mois. Augmentation demandes automatisation.\n\n---\n\n**Défi** : Applications legacy avec dépendances complexes, configuration non documentée, comportements spécifiques environnement.\n\n**Solution** : Documentation et conteneurisation systématiques : documentation toutes dépendances et configurations, création Dockerfiles capturant environnement runtime, utilisation variables environnement pour config, implémentation tests automatisés pour issues environnement.\n\n**Impact** : Élimination problèmes \"fonctionne sur ma machine\". Conteneurs assurant comportement identique cross-environnement.\n\n---\n\n**Défi** : Business nécessitant disponibilité continue mais déploiements traditionnels nécessitant downtime.\n\n**Solution** : Implémentation déploiement blue-green avec load balancer : déploiement vers environnement \"green\", exécution smoke tests, switch trafic, conservation \"blue\" pour rollback instantané, health checks automatisés avant switching.\n\n**Impact** : Temps d'arrêt réduit de heures/jours à 5-10 minutes (propagation DNS uniquement).\n\n## Équipe & Collaboration\n\n3 membres équipe DevOps (Ingénieur DevOps, Architecte Logiciel, Administrateur Système) travaillant avec 15+ développeurs sur projets multiples. Approche Agile avec sprints 2 semaines pour livraison fonctionnalités DevOps. Animation formations hebdomadaires sur workflows Git, Docker, concepts CI/CD et Ansible. Création handbook DevOps complet avec runbooks, guides troubleshooting et best practices.\n\n<!-- SCREENSHOT_PLACEHOLDER: Dashboard Jenkins - pipelines automatisés, historique déploiements, taux succès builds, intégration GitLab -->",
      "image": {
        "url": "https://lh3.googleusercontent.com/d/1ZZwBXlqiyYjaskr5OCGFeTx5u0_gnpT6"
      },
      "technologies": [
        {
          "name": "Jenkins",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/jenkins/jenkins-original.svg"
          }
        },
        {
          "name": "Docker",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/docker/docker-original.svg"
          }
        },
        {
          "name": "Ansible",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon@latest/icons/ansible/ansible-original.svg"
          }
        },
        {
          "name": "GitLab CI/CD",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/gitlab/gitlab-original.svg"
          }
        },
        {
          "name": "Linux",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon@latest/icons/linux/linux-original.svg"
          }
        },
        {
          "name": "Bash",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon@latest/icons/bash/bash-original.svg"
          }
        },
        {
          "name": "Groovy",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon@latest/icons/groovy/groovy-original.svg"
          }
        },
        {
          "name": "Git",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/git/git-original.svg"
          }
        }
      ],
      "links": {
        "live": "#",
        "github": "#"
      }
    }
  ],
  "skillCategories": [
    {
      "name": "Développement Backend",
      "icon": "Server",
      "skills": [
        {
          "name": "Java",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/java/java-original.svg"
          }
        },
        {
          "name": "Spring Boot",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/spring/spring-original.svg"
          }
        },
        {
          "name": "API REST",
          "icon": {
            "base64": "data:image/svg+xml;base64,PHN2ZyB3aWR0aD0iMjQiIGhlaWdodD0iMjQiIHZpZXdCb3g9IjAgMCAyNCAyNCIgZmlsbD0ibm9uZSIgeG1sbnM9Imh0dHA6Ly93d3cudzMub3JnLzIwMDAvc3ZnIj4KPHJlY3Qgd2lkdGg9IjI0IiBoZWlnaHQ9IjI0IiBmaWxsPSIjNjFEQUZCIi8+Cjx0ZXh0IHg9IjIiIHk9IjE2IiBmaWxsPSIjRkZGIiBmb250LXNpemU9IjkiIGZvbnQtZmFtaWx5PSJzZXJpZiIgZm9udC13ZWlnaHQ9ImJvbGQiPkFQSTwvdGV4dD4KPC9zdmc+"
          }
        }
      ]
    },
    {
      "name": "Automatisation des Processus",
      "icon": "Workflow",
      "skills": [
        {
          "name": "BPMN",
          "icon": {
            "base64": "data:image/svg+xml;base64,PHN2ZyB3aWR0aD0iMjQiIGhlaWdodD0iMjQiIHZpZXdCb3g9IjAgMCAyNCAyNCIgZmlsbD0ibm9uZSIgeG1sbnM9Imh0dHA6Ly93d3cudzMub3JnLzIwMDAvc3ZnIj4KPHJlY3Qgd2lkdGg9IjI0IiBoZWlnaHQ9IjI0IiBmaWxsPSIjMzM4NEY2Ii8+Cjx0ZXh0IHg9IjIiIHk9IjE2IiBmaWxsPSIjRkZGIiBmb250LXNpemU9IjkiIGZvbnQtZmFtaWx5PSJzZXJpZiIgZm9udC13ZWlnaHQ9ImJvbGQiPkJQTU48L3RleHQ+Cjwvc3ZnPg=="
          }
        },
        {
          "name": "Flowable BPM",
          "icon": {
            "base64": "data:image/svg+xml;base64,PHN2ZyB3aWR0aD0iMjQiIGhlaWdodD0iMjQiIHZpZXdCb3g9IjAgMCAyNCAyNCIgZmlsbD0ibm9uZSIgeG1sbnM9Imh0dHA6Ly93d3cudzMub3JnLzIwMDAvc3ZnIj4KPHJlY3Qgd2lkdGg9IjI0IiBoZWlnaHQ9IjI0IiBmaWxsPSIjMTBDOTdGIi8+Cjx0ZXh0IHg9IjMiIHk9IjE2IiBmaWxsPSIjRkZGIiBmb250LXNpemU9IjkiIGZvbnQtZmFtaWx5PSJzZXJpZiIgZm9udC13ZWlnaHQ9ImJvbGQiPkZMT1c8L3RleHQ+Cjwvc3ZnPg=="
          }
        }
      ]
    },
    {
      "name": "DevOps & Outils",
      "icon": "Settings",
      "skills": [
        {
          "name": "CI/CD",
          "icon": {
            "base64": "data:image/svg+xml;base64,PHN2ZyB3aWR0aD0iMjQiIGhlaWdodD0iMjQiIHZpZXdCb3g9IjAgMCAyNCAyNCIgZmlsbD0ibm9uZSIgeG1sbnM9Imh0dHA6Ly93d3cudzMub3JnLzIwMDAvc3ZnIj4KPGNpcmNsZSBjeD0iNiIgY3k9IjEyIiByPSIzIiBmaWxsPSIjMTBDOTdGIi8+CjxjaXJjbGUgY3g9IjE4IiBjeT0iMTIiIHI9IjMiIGZpbGw9IiMzQzc3RjAiLz4KPGxpbmUgeDE9IjkiIHkxPSIxMiIgeDI9IjE1IiB5Mj0iMTIiIHN0cm9rZT0iIzMzODRGNiIgc3Ryb2tlLXdpZHRoPSIyIi8+CjxwYXRoIGQ9Ik0xNSA5TDE4IDEyTDE1IDE1IiBzdHJva2U9IiMzMzg0RjYiIHN0cm9rZS13aWR0aD0iMiIgZmlsbD0ibm9uZSIvPgo8L3N2Zz4="
          }
        },
        {
          "name": "Docker",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/docker/docker-original.svg"
          }
        },
        {
          "name": "Jenkins",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/jenkins/jenkins-original.svg"
          }
        },
        {
          "name": "GitLab",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/gitlab/gitlab-original.svg"
          }
        },
        {
          "name": "Liquibase",
          "icon": {
            "base64": "data:image/svg+xml;base64,PHN2ZyB3aWR0aD0iMjQiIGhlaWdodD0iMjQiIHZpZXdCb3g9IjAgMCAyNCAyNCIgZmlsbD0ibm9uZSIgeG1sbnM9Imh0dHA6Ly93d3cudzMub3JnLzIwMDAvc3ZnIj4KPHJlY3Qgd2lkdGg9IjI0IiBoZWlnaHQ9IjI0IiBmaWxsPSIjMkY4MUY3Ii8+Cjx0ZXh0IHg9IjUiIHk9IjE2IiBmaWxsPSIjRkZGIiBmb250LXNpemU9IjEwIiBmb250LWZhbWlseT0ic2VyaWYiIGZvbnQtd2VpZ2h0PSJib2xkIj5MQjwvdGV4dD4KPC9zdmc+"
          }
        },
        {
          "name": "Git",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/git/git-original.svg"
          }
        }
      ]
    },
    {
      "name": "Authentification & Sécurité",
      "icon": "Shield",
      "skills": [
        {
          "name": "Keycloak",
          "icon": {
            "base64": "data:image/svg+xml;base64,PHN2ZyB3aWR0aD0iMjQiIGhlaWdodD0iMjQiIHZpZXdCb3g9IjAgMCAyNCAyNCIgZmlsbD0ibm9uZSIgeG1sbnM9Imh0dHA6Ly93d3cudzMub3JnLzIwMDAvc3ZnIj4KPHJlY3Qgd2lkdGg9IjI0IiBoZWlnaHQ9IjI0IiBmaWxsPSIjNEQ0RDRGIi8+Cjx0ZXh0IHg9IjUiIHk9IjE2IiBmaWxsPSIjRkZGIiBmb250LXNpemU9IjEwIiBmb250LWZhbWlseT0ic2VyaWYiIGZvbnQtd2VpZ2h0PSJib2xkIj5LQzwvdGV4dD4KPC9zdmc+"
          }
        },
        {
          "name": "OAuth2/OIDC",
          "icon": {
            "base64": "data:image/svg+xml;base64,PHN2ZyB3aWR0aD0iMjQiIGhlaWdodD0iMjQiIHZpZXdCb3g9IjAgMCAyNCAyNCIgZmlsbD0ibm9uZSIgeG1sbnM9Imh0dHA6Ly93d3cudzMub3JnLzIwMDAvc3ZnIj4KPGNpcmNsZSBjeD0iMTIiIGN5PSIxMiIgcj0iMTAiIGZpbGw9IiNGRkY1NTIiLz4KPHN0YXIgY3g9IjEyIiBjeT0iMTIiIHI9IjQiIGZpbGw9IiMzMzMiLz4KPC9zdmc+"
          }
        }
      ]
    },
    {
      "name": "Base de Données & Architecture",
      "icon": "Database",
      "skills": [
        {
          "name": "PostgreSQL",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/postgresql/postgresql-original.svg"
          }
        },
        {
          "name": "MongoDB",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/mongodb/mongodb-original.svg"
          }
        },
        {
          "name": "MySQL",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/mysql/mysql-original.svg"
          }
        },
        {
          "name": "Domain-Driven Design",
          "icon": {
            "base64": "data:image/svg+xml;base64,PHN2ZyB3aWR0aD0iMjQiIGhlaWdodD0iMjQiIHZpZXdCb3g9IjAgMCAyNCAyNCIgZmlsbD0ibm9uZSIgeG1sbnM9Imh0dHA6Ly93d3cudzMub3JnLzIwMDAvc3ZnIj4KPHJlY3Qgd2lkdGg9IjI0IiBoZWlnaHQ9IjI0IiBmaWxsPSIjNkY0MkMxIi8+Cjx0ZXh0IHg9IjMiIHk9IjE2IiBmaWxsPSIjRkZGIiBmb250LXNpemU9IjEwIiBmb250LWZhbWlseT0ic2VyaWYiIGZvbnQtd2VpZ2h0PSJib2xkIj5ERDs8L3RleHQ+Cjwvc3ZnPg=="
          }
        },
        {
          "name": "Architecture Hexagonale",
          "icon": {
            "base64": "data:image/svg+xml;base64,PHN2ZyB3aWR0aD0iMjQiIGhlaWdodD0iMjQiIHZpZXdCb3g9IjAgMCAyNCAyNCIgZmlsbD0ibm9uZSIgeG1sbnM9Imh0dHA6Ly93d3cudzMub3JnLzIwMDAvc3ZnIj4KPHBvbHlnb24gcG9pbnRzPSIxMiwyIDIwLDYgMjAsMTggMTIsMjIgNCwxOCA0LDYiIGZpbGw9IiNFRjQ0NDQiLz4KPHN0YXIgY3g9IjEyIiBjeT0iMTIiIHI9IjMiIGZpbGw9IiNGRkYiLz4KPC9zdmc+"
          }
        }
      ]
    },
    {
      "name": "Technologies Frontend",
      "icon": "Monitor",
      "skills": [
        {
          "name": "React",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/react/react-original.svg"
          }
        },
        {
          "name": "Angular",
          "icon": {
            "url": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/angularjs/angularjs-original.svg"
          }
        },
        {
          "name": "Formio",
          "icon": {
            "base64": "data:image/svg+xml;base64,PHN2ZyB3aWR0aD0iMjQiIGhlaWdodD0iMjQiIHZpZXdCb3g9IjAgMCAyNCAyNCIgZmlsbD0ibm9uZSIgeG1sbnM9Imh0dHA6Ly93d3cudzMub3JnLzIwMDAvc3ZnIj4KPHJlY3Qgd2lkdGg9IjI0IiBoZWlnaHQ9IjI0IiBmaWxsPSIjNDI5RkY0Ii8+Cjx0ZXh0IHg9IjQiIHk9IjE2IiBmaWxsPSIjRkZGIiBmb250LXNpemU9IjEwIiBmb250LWZhbWlseT0ic2VyaWYiIGZvbnQtd2VpZ2h0PSJib2xkIj5GTzwvdGV4dD4KPC9zdmc+"
          }
        }
      ]
    }
  ],
  "achievements": [
    {
      "icon": "Users",
      "number": "5+",
      "title": "Années d'Expérience",
      "description": "Spécialisé en Développement Backend et architecture logicielle"
    },
    {
      "icon": "Built",
      "number": "6+",
      "title": "Projets Livrés",
      "description": "Solutions bancaires et d'assurance livrées avec succès"
    }
  ],
  "contactInfo": {
    "title": "Connectons-nous",
    "description": "Je suis toujours intéressé à discuter de nouvelles opportunités, de projets innovants et à me connecter avec d'autres passionnés de technologie.",
    "locationTitle": "Localisation",
    "locationDescription": "Disponible pour le travail à distance et les déplacements",
    "cta": {
      "title": "Prêt à Commencer ?",
      "description": "Discutons de la manière dont je peux aider à architecturer des solutions pour votre prochain grand projet.",
      "button1": "Démarrer une Conversation",
      "button2": "Planifier un Appel"
    },
    "responseTime": "Temps de réponse : Généralement sous 24 heures",
    "email": "mohamed.el.abed.24@gmail.com",
    "linkedin": "www.linkedin.com/in/mohamed-iben-el-abed",
    "github": "github.com/Makros-24",
    "twitter": "",
    "phone": "+216-50-622-368",
    "location": "Sousse, Tunisie",
    "methods": {
      "email": {
        "description": "Envoyez-moi un email"
      },
      "linkedin": {
        "description": "Connectez-vous sur LinkedIn"
      },
      "github": {
        "description": "Voir mon code"
      },
      "twitter": {
        "description": "Suivez-moi sur X"
      }
    }
  },
  "footer": {
    "copyrightName": "Mohamed IBEN EL ABED",
    "copyrightYear": 2024,
    "madeWithText": "Conçu avec passion pour la technologie et l'innovation."
  }
}
